# Copyright (c) 2022 vesoft inc. All rights reserved.
#
# This source code is licensed under Apache 2.0 License.
Feature: single shortestPath

  Background:
    Given a graph with space named "nba"

  Scenario: shortest path invalid step
    When executing query:
      """
      WITH ["Tim Duncan","Tony Parker"] as list1
      MATCH shortestPath((v1:player)-[e*2]-(v2:player))
        WHERE id(v1) in list1 AND id(v2) in list1
        RETURN e
      """
    Then a SemanticError should be raised at runtime: The minimal number of steps for shortestPath() must be either 0 or 1.
    When executing query:
      """
      WITH ["Tim Duncan","Tony Parker"] as list1
      MATCH shortestPath((v1:player)-[e*2..4]-(v2:player))
        WHERE id(v1) in list1 AND id(v2) in list1
        RETURN e
      """
    Then a SemanticError should be raised at runtime: The minimal number of steps for shortestPath() must be either 0 or 1.
    When executing query:
      """
      WITH ["Tim Duncan","Tony Parker"] as list1
      MATCH shortestPath((v1:player)-[e]->(b)--(v2:player))
        WHERE id(v1) in list1 AND id(v2) in list1
        RETURN e
      """
    Then a SemanticError should be raised at runtime: `shortestPath(...)' only support pattern like (start)-[edge*..hop]-(end)
    When executing query:
      """
      WITH ["Tim Duncan","Tony Parker"] as list1
      MATCH shortestPath((v1:player)-[e]->(b)-[e2:like]-(v2:player))
        WHERE id(v1) in list1 AND id(v2) in list1
        RETURN e
      """
    Then a SemanticError should be raised at runtime: `shortestPath(...)' only support pattern like (start)-[edge*..hop]-(end)

  Scenario: zero step shortestpath
    When executing query:
      """
      WITH ["Tim Duncan","Tony Parker"] as list1
      MATCH shortestPath((v1:player)-[e*0]-(v2:player))
        WHERE id(v1) in list1 AND id(v2) in list1
        RETURN e
      """
    Then the result should be, in any order, with relax comparison:
      | e |
    When executing query:
      """
      MATCH shortestPath((v1:player{name:"Tim Duncan"})-[e*0]-(v2:player{name:"Tony Parker"}))
      RETURN e
      """
    Then the result should be, in any order, with relax comparison:
      | e |

  Scenario: single shortestPath1
    When executing query:
      """
      MATCH p = shortestPath( (a:player{name:"Tim Duncan"})-[e*..5]-(b:player{name:"Tony Parker"}) )  RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                                                                                     |
      | <("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})<-[:teammate@0 {end_year: 2016, start_year: 2001}]-("Tony Parker" :player{age: 36, name: "Tony Parker"})> |
    When executing query:
      """
      MATCH p = shortestPath( (a:player{name:"Tim Duncan"})-[e*..5]-(b:player{name:"Tony Parker"}) )  RETURN a, e, b
      """
    Then the result should be, in any order, with relax comparison:
      | a                                                                                                           | e                                                                               | b                                                     |
      | ("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"}) | [[:teammate "Tony Parker"->"Tim Duncan" @0 {end_year: 2016, start_year: 2001}]] | ("Tony Parker" :player{age: 36, name: "Tony Parker"}) |
    When executing query:
      """
      MATCH p = shortestPath( (a:player{name:"Tim Duncan"})-[e*..5]-(b:player{name:"Tony Parker"}) )  RETURN e, p
      """
    Then the result should be, in any order, with relax comparison:
      | e                                                                               | p                                                                                                                                                                                                                     |
      | [[:teammate "Tony Parker"->"Tim Duncan" @0 {end_year: 2016, start_year: 2001}]] | <("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})<-[:teammate@0 {end_year: 2016, start_year: 2001}]-("Tony Parker" :player{age: 36, name: "Tony Parker"})> |
    When executing query:
      """
      MATCH p = shortestPath( (a:player{name:"Tiago Splitter"})-[e:like*..5]->(b:player{name:"LaMarcus Aldridge"}) ) RETURN  p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                                                                                                                                                                                                                                               |
      | <("Tiago Splitter" :player{age: 34, name: "Tiago Splitter"})-[:like@0 {likeness: 80}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})-[:like@0 {likeness: 95}]->("Tony Parker" :player{age: 36, name: "Tony Parker"})-[:like@0 {likeness: 90}]->("LaMarcus Aldridge" :player{age: 33, name: "LaMarcus Aldridge"})> |
    When executing query:
      """
      MATCH p = shortestPath( (a:player{name:"Tiago Splitter"})-[e*..5]->(b:player{name:"LaMarcus Aldridge"}) ) RETURN  p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                                                                                                                                                                                       |
      | <("Tiago Splitter" :player{age: 34, name: "Tiago Splitter"})-[:like@0 {likeness: 80}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})-[:teammate@0 {end_year: 2016, start_year: 2015}]->("LaMarcus Aldridge" :player{age: 33, name: "LaMarcus Aldridge"})> |
    When executing query:
      """
      MATCH p = shortestPath( (a:player{name:"Tiago Splitter"})-[e*..5]->(b:player{name:"LaMarcus Aldridge"}) )
        WHERE length(p) > 2
        RETURN  p
      """
    Then the result should be, in any order, with relax comparison:
      | p |
    When executing query:
      """
      MATCH p = shortestPath( (a:player{name:"Tiago Splitter"})-[e*..1]->(b:player{name:"Tim Duncan"}) ) RETURN  nodes(p), relationships(p)
      """
    Then the result should be, in any order, with relax comparison:
      | nodes(p)                                                                                                                                                                   | relationships(p)                                           |
      | [("Tiago Splitter" :player{age: 34, name: "Tiago Splitter"}), ("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})] | [[:like "Tiago Splitter"->"Tim Duncan" @0 {likeness: 80}]] |
    When executing query:
      """
      MATCH p = shortestPath( (a:player{age:30})-[e*..5]->(b:player{name:"LeBron James"}) )  RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                                                                                           |
      | <("Blake Griffin" :player{age: 30, name: "Blake Griffin"})-[:like@0 {likeness: -1}]->("Chris Paul" :player{age: 33, name: "Chris Paul"})-[:like@0 {likeness: 90}]->("LeBron James" :player{age: 34, name: "LeBron James"})> |
    When executing query:
      """
      MATCH p = shortestPath( (a:player{age:30})-[e*..5]->(b:team) ) WHERE id(a) != 'Blake Griffin' RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                                                                                                       |
      | <("DeAndre Jordan" :player{age: 30, name: "DeAndre Jordan"})-[:serve@0 {end_year: 2019, start_year: 2019}]->("Knicks" :team{name: "Knicks"})>                                                                                           |
      | <("DeAndre Jordan" :player{age: 30, name: "DeAndre Jordan"})-[:serve@0 {end_year: 2019, start_year: 2018}]->("Mavericks" :team{name: "Mavericks"})>                                                                                     |
      | <("DeAndre Jordan" :player{age: 30, name: "DeAndre Jordan"})-[:serve@0 {end_year: 2018, start_year: 2008}]->("Clippers" :team{name: "Clippers"})>                                                                                       |
      | <("Kevin Durant" :player{age: 30, name: "Kevin Durant"})-[:serve@0 {end_year: 2016, start_year: 2007}]->("Thunders" :team{name: "Thunders"})>                                                                                           |
      | <("Kevin Durant" :player{age: 30, name: "Kevin Durant"})-[:serve@0 {end_year: 2019, start_year: 2016}]->("Warriors" :team{name: "Warriors"})>                                                                                           |
      | <("Russell Westbrook" :player{age: 30, name: "Russell Westbrook"})-[:like@0 {likeness: 90}]->("James Harden" :player{age: 29, name: "James Harden"})-[:serve@0 {end_year: 2019, start_year: 2012}]->("Rockets" :team{name: "Rockets"})> |
      | <("Russell Westbrook" :player{age: 30, name: "Russell Westbrook"})-[:serve@0 {end_year: 2019, start_year: 2008}]->("Thunders" :team{name: "Thunders"})>                                                                                 |
      | <("Russell Westbrook" :player{age: 30, name: "Russell Westbrook"})-[:like@0 {likeness: 90}]->("Paul George" :player{age: 28, name: "Paul George"})-[:serve@0 {end_year: 2017, start_year: 2010}]->("Pacers" :team{name: "Pacers"})>     |
    When executing query:
      """
      MATCH p = shortestPath( (a:player{age:30})-[e*..5]->(b:team) )
        WHERE length(p) == 1
        RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                       |
      | <("DeAndre Jordan" :player{age: 30, name: "DeAndre Jordan"})-[:serve@0 {end_year: 2019, start_year: 2019}]->("Knicks" :team{name: "Knicks"})>           |
      | <("DeAndre Jordan" :player{age: 30, name: "DeAndre Jordan"})-[:serve@0 {end_year: 2019, start_year: 2018}]->("Mavericks" :team{name: "Mavericks"})>     |
      | <("DeAndre Jordan" :player{age: 30, name: "DeAndre Jordan"})-[:serve@0 {end_year: 2018, start_year: 2008}]->("Clippers" :team{name: "Clippers"})>       |
      | <("Kevin Durant" :player{age: 30, name: "Kevin Durant"})-[:serve@0 {end_year: 2016, start_year: 2007}]->("Thunders" :team{name: "Thunders"})>           |
      | <("Kevin Durant" :player{age: 30, name: "Kevin Durant"})-[:serve@0 {end_year: 2019, start_year: 2016}]->("Warriors" :team{name: "Warriors"})>           |
      | <("Russell Westbrook" :player{age: 30, name: "Russell Westbrook"})-[:serve@0 {end_year: 2019, start_year: 2008}]->("Thunders" :team{name: "Thunders"})> |
      | <("Blake Griffin" :player{age: 30, name: "Blake Griffin"})-[:serve@0 {end_year: 2018, start_year: 2009}]->("Clippers" :team{name: "Clippers"})>         |
      | <("Blake Griffin" :player{age: 30, name: "Blake Griffin"})-[:serve@0 {end_year: 2019, start_year: 2018}]->("Pistons" :team{name: "Pistons"})>           |
    When executing query:
      """
      MATCH p = shortestPath( (a:player{name:"Yao Ming"})-[e:serve*1..3]-(b:team) ) RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                                                                                                                                                                                                  |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:serve@0 {end_year: 2011, start_year: 2002}]->("Rockets" :team{name: "Rockets"})<-[:serve@0 {end_year: 2016, start_year: 2013}]-("Dwight Howard" :player{age: 33, name: "Dwight Howard"})-[:serve@0 {end_year: 2013, start_year: 2012}]->("Lakers" :team{name: "Lakers"})>       |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:serve@0 {end_year: 2011, start_year: 2002}]->("Rockets" :team{name: "Rockets"})<-[:serve@0 {end_year: 2019, start_year: 2018}]-("Carmelo Anthony" :player{age: 34, name: "Carmelo Anthony"})-[:serve@0 {end_year: 2017, start_year: 2011}]->("Knicks" :team{name: "Knicks"})>   |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:serve@0 {end_year: 2011, start_year: 2002}]->("Rockets" :team{name: "Rockets"})<-[:serve@0 {end_year: 2016, start_year: 2013}]-("Dwight Howard" :player{age: 33, name: "Dwight Howard"})-[:serve@0 {end_year: 2018, start_year: 2017}]->("Hornets" :team{name: "Hornets"})>     |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:serve@0 {end_year: 2011, start_year: 2002}]->("Rockets" :team{name: "Rockets"})<-[:serve@0 {end_year: 2021, start_year: 2017}]-("Chris Paul" :player{age: 33, name: "Chris Paul"})-[:serve@0 {end_year: 2017, start_year: 2011}]->("Clippers" :team{name: "Clippers"})>         |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:serve@0 {end_year: 2011, start_year: 2002}]->("Rockets" :team{name: "Rockets"})<-[:serve@0 {end_year: 2019, start_year: 2018}]-("Carmelo Anthony" :player{age: 34, name: "Carmelo Anthony"})-[:serve@0 {end_year: 2011, start_year: 2003}]->("Nuggets" :team{name: "Nuggets"})> |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:serve@0 {end_year: 2011, start_year: 2002}]->("Rockets" :team{name: "Rockets"})>                                                                                                                                                                                                |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:serve@0 {end_year: 2011, start_year: 2002}]->("Rockets" :team{name: "Rockets"})<-[:serve@0 {end_year: 2010, start_year: 2004}]-("Tracy McGrady" :player{age: 39, name: "Tracy McGrady"})-[:serve@0 {end_year: 2013, start_year: 2013}]->("Spurs" :team{name: "Spurs"})>         |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:serve@0 {end_year: 2011, start_year: 2002}]->("Rockets" :team{name: "Rockets"})<-[:serve@0 {end_year: 2019, start_year: 2012}]-("James Harden" :player{age: 29, name: "James Harden"})-[:serve@0 {end_year: 2012, start_year: 2009}]->("Thunders" :team{name: "Thunders"})>     |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:serve@0 {end_year: 2011, start_year: 2002}]->("Rockets" :team{name: "Rockets"})<-[:serve@0 {end_year: 2010, start_year: 2004}]-("Tracy McGrady" :player{age: 39, name: "Tracy McGrady"})-[:serve@0 {end_year: 2004, start_year: 2000}]->("Magic" :team{name: "Magic"})>         |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:serve@0 {end_year: 2011, start_year: 2002}]->("Rockets" :team{name: "Rockets"})<-[:serve@0 {end_year: 2016, start_year: 2013}]-("Dwight Howard" :player{age: 33, name: "Dwight Howard"})-[:serve@0 {end_year: 2017, start_year: 2016}]->("Hawks" :team{name: "Hawks"})>         |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:serve@0 {end_year: 2011, start_year: 2002}]->("Rockets" :team{name: "Rockets"})<-[:serve@0 {end_year: 2010, start_year: 2004}]-("Tracy McGrady" :player{age: 39, name: "Tracy McGrady"})-[:serve@0 {end_year: 2000, start_year: 1997}]->("Raptors" :team{name: "Raptors"})>     |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:serve@0 {end_year: 2011, start_year: 2002}]->("Rockets" :team{name: "Rockets"})<-[:serve@0 {end_year: 2016, start_year: 2013}]-("Dwight Howard" :player{age: 33, name: "Dwight Howard"})-[:serve@0 {end_year: 2019, start_year: 2018}]->("Wizards" :team{name: "Wizards"})>     |

  Scenario: single shortestPaths2
    When executing query:
      """
      MATCH p = shortestPath( (a)-[e*..5]-(b) )
        WHERE id(a) == 'Tim Duncan' and id(b) in ['Spurs', 'Tony Parker', 'Yao Ming']
        RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                                                                                                                                                 |
      | <("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})-[:serve@0 {end_year: 2016, start_year: 1997}]->("Spurs" :team{name: "Spurs"})>                                                                                       |
      | <("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})<-[:teammate@0 {end_year: 2016, start_year: 2001}]-("Tony Parker" :player{age: 36, name: "Tony Parker"})>                                                             |
      | <("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})<-[:like@0 {likeness: 80}]-("Shaquille O'Neal" :player{age: 47, name: "Shaquille O'Neal"})<-[:like@0 {likeness: 90}]-("Yao Ming" :player{age: 38, name: "Yao Ming"})> |
    When executing query:
      """
      MATCH p = shortestPath( (a)-[e*..5]->(b) )
        WHERE id(a) == 'Tim Duncan' and id(b) IN ['Spurs', 'Tony Parker', 'Yao Ming']
        RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                                                                                     |
      | <("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})-[:serve@0 {end_year: 2016, start_year: 1997}]->("Spurs" :team{name: "Spurs"})>                           |
      | <("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})-[:teammate@0 {end_year: 2016, start_year: 2001}]->("Tony Parker" :player{age: 36, name: "Tony Parker"})> |
    When executing query:
      """
      MATCH p = shortestPath( (a)-[e*..5]->(b) )
        WHERE id(b) IN ['Manu Ginobili', 'Spurs', 'Lakers'] and id(a) in ['Tony Parker', 'Yao Ming']
        RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |
      | <("Tony Parker" :player{age: 36, name: "Tony Parker"})-[:teammate@0 {end_year: 2018, start_year: 2002}]->("Manu Ginobili" :player{age: 41, name: "Manu Ginobili"})>                                                                                                                                                                                                                                                                                                                             |
      | <("Tony Parker" :player{age: 36, name: "Tony Parker"})-[:serve@0 {end_year: 2018, start_year: 1999}]->("Spurs" :team{name: "Spurs"})>                                                                                                                                                                                                                                                                                                                                                           |
      | <("Tony Parker" :player{age: 36, name: "Tony Parker"})-[:teammate@0 {end_year: 2016, start_year: 2001}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})-[:teammate@0 {end_year: 2016, start_year: 2010}]->("Danny Green" :player{age: 31, name: "Danny Green"})-[:like@0 {likeness: 80}]->("LeBron James" :player{age: 34, name: "LeBron James"})-[:serve@0 {end_year: 2019, start_year: 2018}]->("Lakers" :team{name: "Lakers"})> |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:like@0 {likeness: 90}]->("Shaquille O'Neal" :player{age: 47, name: "Shaquille O'Neal"})-[:like@0 {likeness: 80}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})-[:teammate@0 {end_year: 2016, start_year: 2002}]->("Manu Ginobili" :player{age: 41, name: "Manu Ginobili"})>                                                                                                   |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:like@0 {likeness: 90}]->("Tracy McGrady" :player{age: 39, name: "Tracy McGrady"})-[:serve@0 {end_year: 2013, start_year: 2013}]->("Spurs" :team{name: "Spurs"})>                                                                                                                                                                                                                                                                             |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:like@0 {likeness: 90}]->("Shaquille O'Neal" :player{age: 47, name: "Shaquille O'Neal"})-[:serve@0 {end_year: 2004, start_year: 1996}]->("Lakers" :team{name: "Lakers"})>                                                                                                                                                                                                                                                                     |
    When executing query:
      """
      MATCH p = shortestPath( (a)-[e:like*..4]->(b) )
        WHERE id(b) IN ['Manu Ginobili', 'Spurs', 'Lakers'] and id(a) in ['Tony Parker', 'Yao Ming']
        RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                                                                                                                                                                                                                                     |
      | <("Tony Parker" :player{age: 36, name: "Tony Parker"})-[:like@0 {likeness: 95}]->("Manu Ginobili" :player{age: 41, name: "Manu Ginobili"})>                                                                                                                                                                                                                           |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:like@0 {likeness: 90}]->("Shaquille O'Neal" :player{age: 47, name: "Shaquille O'Neal"})-[:like@0 {likeness: 80}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})-[:like@0 {likeness: 95}]->("Manu Ginobili" :player{age: 41, name: "Manu Ginobili"})> |
    When executing query:
      """
      MATCH p = shortestPath( (a)-[e:like*..4]->(b) )
        WHERE id(b) IN ['Manu Ginobili', 'Spurs', 'Lakers'] and id(a) in ['xxx', 'zzz']
        RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p |

  Scenario: single shortestPaths3
    When executing query:
      """
      MATCH (a:player{name:"Tim Duncan"}), (b:team{name:"Spurs"})
      MATCH p = shortestPath( (a)-[e:serve*..3]-(b) )
        RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                                                           |
      | <("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})-[:serve@0 {end_year: 2016, start_year: 1997}]->("Spurs" :team{name: "Spurs"})> |
    When executing query:
      """
      MATCH (a:player{name:"Tim Duncan"}), (b:team{name:"Spurs"}), p = shortestPath( (a)-[e:serve*..3]-(b) ) RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                                                           |
      | <("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})-[:serve@0 {end_year: 2016, start_year: 1997}]->("Spurs" :team{name: "Spurs"})> |
    When executing query:
      """
      MATCH (a:player{name:"Tim Duncan"}), (b:team)
      MATCH p = shortestPath( (a)-[e:serve*..3]-(b) )
      RETURN b, length(p)
      """
    Then the result should be, in any order, with relax comparison:
      | b                                              | length(p) |
      | ("76ers" :team{name: "76ers"})                 | 3         |
      | ("Grizzlies" :team{name: "Grizzlies"})         | 3         |
      | ("Spurs" :team{name: "Spurs"})                 | 1         |
      | ("Bulls" :team{name: "Bulls"})                 | 3         |
      | ("Cavaliers" :team{name: "Cavaliers"})         | 3         |
      | ("Celtics" :team{name: "Celtics"})             | 3         |
      | ("Pacers" :team{name: "Pacers"})               | 3         |
      | ("Hawks" :team{name: "Hawks"})                 | 3         |
      | ("Lakers" :team{name: "Lakers"})               | 3         |
      | ("Raptors" :team{name: "Raptors"})             | 3         |
      | ("Warriors" :team{name: "Warriors"})           | 3         |
      | ("Hornets" :team{name: "Hornets"})             | 3         |
      | ("Kings" :team{name: "Kings"})                 | 3         |
      | ("Pistons" :team{name: "Pistons"})             | 3         |
      | ("Rockets" :team{name: "Rockets"})             | 3         |
      | ("Suns" :team{name: "Suns"})                   | 3         |
      | ("Trail Blazers" :team{name: "Trail Blazers"}) | 3         |
      | ("Bucks" :team{name: "Bucks"})                 | 3         |
      | ("Jazz" :team{name: "Jazz"})                   | 3         |
      | ("Magic" :team{name: "Magic"})                 | 3         |
    When executing query:
      """
      MATCH (b:team), (a:player{age:30})
      MATCH p = shortestPath( (a)-[e*..5]->(b) )
        WHERE length(p) == 1
        RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                       |
      | <("DeAndre Jordan" :player{age: 30, name: "DeAndre Jordan"})-[:serve@0 {end_year: 2019, start_year: 2019}]->("Knicks" :team{name: "Knicks"})>           |
      | <("DeAndre Jordan" :player{age: 30, name: "DeAndre Jordan"})-[:serve@0 {end_year: 2019, start_year: 2018}]->("Mavericks" :team{name: "Mavericks"})>     |
      | <("DeAndre Jordan" :player{age: 30, name: "DeAndre Jordan"})-[:serve@0 {end_year: 2018, start_year: 2008}]->("Clippers" :team{name: "Clippers"})>       |
      | <("Kevin Durant" :player{age: 30, name: "Kevin Durant"})-[:serve@0 {end_year: 2016, start_year: 2007}]->("Thunders" :team{name: "Thunders"})>           |
      | <("Kevin Durant" :player{age: 30, name: "Kevin Durant"})-[:serve@0 {end_year: 2019, start_year: 2016}]->("Warriors" :team{name: "Warriors"})>           |
      | <("Russell Westbrook" :player{age: 30, name: "Russell Westbrook"})-[:serve@0 {end_year: 2019, start_year: 2008}]->("Thunders" :team{name: "Thunders"})> |
      | <("Blake Griffin" :player{age: 30, name: "Blake Griffin"})-[:serve@0 {end_year: 2018, start_year: 2009}]->("Clippers" :team{name: "Clippers"})>         |
      | <("Blake Griffin" :player{age: 30, name: "Blake Griffin"})-[:serve@0 {end_year: 2019, start_year: 2018}]->("Pistons" :team{name: "Pistons"})>           |
    When executing query:
      """
      MATCH (b:team)
      MATCH p = shortestPath( (a:player)-[e*..5]->(b) )
        WHERE a.player.age == 30 AND length(p) == 1
        RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                       |
      | <("DeAndre Jordan" :player{age: 30, name: "DeAndre Jordan"})-[:serve@0 {end_year: 2019, start_year: 2019}]->("Knicks" :team{name: "Knicks"})>           |
      | <("DeAndre Jordan" :player{age: 30, name: "DeAndre Jordan"})-[:serve@0 {end_year: 2019, start_year: 2018}]->("Mavericks" :team{name: "Mavericks"})>     |
      | <("DeAndre Jordan" :player{age: 30, name: "DeAndre Jordan"})-[:serve@0 {end_year: 2018, start_year: 2008}]->("Clippers" :team{name: "Clippers"})>       |
      | <("Kevin Durant" :player{age: 30, name: "Kevin Durant"})-[:serve@0 {end_year: 2016, start_year: 2007}]->("Thunders" :team{name: "Thunders"})>           |
      | <("Kevin Durant" :player{age: 30, name: "Kevin Durant"})-[:serve@0 {end_year: 2019, start_year: 2016}]->("Warriors" :team{name: "Warriors"})>           |
      | <("Russell Westbrook" :player{age: 30, name: "Russell Westbrook"})-[:serve@0 {end_year: 2019, start_year: 2008}]->("Thunders" :team{name: "Thunders"})> |
      | <("Blake Griffin" :player{age: 30, name: "Blake Griffin"})-[:serve@0 {end_year: 2018, start_year: 2009}]->("Clippers" :team{name: "Clippers"})>         |
      | <("Blake Griffin" :player{age: 30, name: "Blake Griffin"})-[:serve@0 {end_year: 2019, start_year: 2018}]->("Pistons" :team{name: "Pistons"})>           |
    When executing query:
      """
      MATCH (b:team)
      MATCH p = shortestPath( (a:player)-[e*..5]->(b) )
        WHERE id(a) IN ['DeAndre Jordan', 'Kevin Durant', 'Russell Westbrook', 'Blake Griffin'] AND length(p) == 1
        RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                       |
      | <("DeAndre Jordan" :player{age: 30, name: "DeAndre Jordan"})-[:serve@0 {end_year: 2019, start_year: 2019}]->("Knicks" :team{name: "Knicks"})>           |
      | <("DeAndre Jordan" :player{age: 30, name: "DeAndre Jordan"})-[:serve@0 {end_year: 2019, start_year: 2018}]->("Mavericks" :team{name: "Mavericks"})>     |
      | <("DeAndre Jordan" :player{age: 30, name: "DeAndre Jordan"})-[:serve@0 {end_year: 2018, start_year: 2008}]->("Clippers" :team{name: "Clippers"})>       |
      | <("Kevin Durant" :player{age: 30, name: "Kevin Durant"})-[:serve@0 {end_year: 2016, start_year: 2007}]->("Thunders" :team{name: "Thunders"})>           |
      | <("Kevin Durant" :player{age: 30, name: "Kevin Durant"})-[:serve@0 {end_year: 2019, start_year: 2016}]->("Warriors" :team{name: "Warriors"})>           |
      | <("Russell Westbrook" :player{age: 30, name: "Russell Westbrook"})-[:serve@0 {end_year: 2019, start_year: 2008}]->("Thunders" :team{name: "Thunders"})> |
      | <("Blake Griffin" :player{age: 30, name: "Blake Griffin"})-[:serve@0 {end_year: 2018, start_year: 2009}]->("Clippers" :team{name: "Clippers"})>         |
      | <("Blake Griffin" :player{age: 30, name: "Blake Griffin"})-[:serve@0 {end_year: 2019, start_year: 2018}]->("Pistons" :team{name: "Pistons"})>           |

  Scenario: single shortestPaths4
    When executing query:
      """
      MATCH p = shortestPath( (a:player)-[e:serve*..3]-(b:team) )
        WHERE a.player.name == 'Tim Duncan' AND b.team.name == 'Spurs'
        RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                                                           |
      | <("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})-[:serve@0 {end_year: 2016, start_year: 1997}]->("Spurs" :team{name: "Spurs"})> |
    When executing query:
      """
      MATCH p = shortestPath( (a:player)-[e:serve*..3]-(b:team) )
        WHERE a.player.age > 45 AND b.team.name == 'Spurs'
        RETURN length(p)
      """
    Then the result should be, in any order, with relax comparison:
      | length(p) |
      | 3         |
      | 3         |
    When executing query:
      """
      MATCH p = shortestPath( (a:player)-[e:like*..3]-(b:player) )
        WHERE a.player.age >  45 AND b.player.age < 30
        RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                                                                                                                                                                                                                                                         |
      | <("Shaquille O'Neal" :player{age: 47, name: "Shaquille O'Neal"})-[:like@0 {likeness: 80}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})<-[:like@0 {likeness: 99}]-("Dejounte Murray" :player{age: 29, name: "Dejounte Murray"})-[:like@0 {likeness: 99}]->("James Harden" :player{age: 29, name: "James Harden"})>         |
      | <("Shaquille O'Neal" :player{age: 47, name: "Shaquille O'Neal"})-[:like@0 {likeness: 80}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})<-[:like@0 {likeness: 99}]-("Dejounte Murray" :player{age: 29, name: "Dejounte Murray"})-[:like@0 {likeness: 99}]->("Kyle Anderson" :player{age: 25, name: "Kyle Anderson"})>       |
      | <("Shaquille O'Neal" :player{age: 47, name: "Shaquille O'Neal"})-[:like@0 {likeness: 80}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})<-[:like@0 {likeness: 75}]-("LaMarcus Aldridge" :player{age: 33, name: "LaMarcus Aldridge"})<-[:like@0 {likeness: 80}]-("Damian Lillard" :player{age: 28, name: "Damian Lillard"})> |
      | <("Shaquille O'Neal" :player{age: 47, name: "Shaquille O'Neal"})-[:like@0 {likeness: 80}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})<-[:like@0 {likeness: 99}]-("Dejounte Murray" :player{age: 29, name: "Dejounte Murray"})>                                                                                           |
    When executing query:
      """
      MATCH (a:player)
      MATCH p = shortestPath( (a)<-[e:like*..2]-(b:player{name:"Yao Ming"}) )
        RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                                                                                                                                                 |
      | <("Kobe Bryant" :player{age: 40, name: "Kobe Bryant"})<-[:like@0 {likeness: 90}]-("Tracy McGrady" :player{age: 39, name: "Tracy McGrady"})<-[:like@0 {likeness: 90}]-("Yao Ming" :player{age: 38, name: "Yao Ming"})>                                                             |
      | <("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})<-[:like@0 {likeness: 80}]-("Shaquille O'Neal" :player{age: 47, name: "Shaquille O'Neal"})<-[:like@0 {likeness: 90}]-("Yao Ming" :player{age: 38, name: "Yao Ming"})> |
      | <("Rudy Gay" :player{age: 32, name: "Rudy Gay"})<-[:like@0 {likeness: 90}]-("Tracy McGrady" :player{age: 39, name: "Tracy McGrady"})<-[:like@0 {likeness: 90}]-("Yao Ming" :player{age: 38, name: "Yao Ming"})>                                                                   |
      | <("Grant Hill" :player{age: 46, name: "Grant Hill"})<-[:like@0 {likeness: 90}]-("Tracy McGrady" :player{age: 39, name: "Tracy McGrady"})<-[:like@0 {likeness: 90}]-("Yao Ming" :player{age: 38, name: "Yao Ming"})>                                                               |
      | <("JaVale McGee" :player{age: 31, name: "JaVale McGee"})<-[:like@0 {likeness: 100}]-("Shaquille O'Neal" :player{age: 47, name: "Shaquille O'Neal"})<-[:like@0 {likeness: 90}]-("Yao Ming" :player{age: 38, name: "Yao Ming"})>                                                    |
      | <("Shaquille O'Neal" :player{age: 47, name: "Shaquille O'Neal"})<-[:like@0 {likeness: 90}]-("Yao Ming" :player{age: 38, name: "Yao Ming"})>                                                                                                                                       |
      | <("Tracy McGrady" :player{age: 39, name: "Tracy McGrady"})<-[:like@0 {likeness: 90}]-("Yao Ming" :player{age: 38, name: "Yao Ming"})>                                                                                                                                             |
    When executing query:
      """
      MATCH (a:player)
      MATCH p = shortestPath( (a)-[e:like*..2]->(b:player{name:"Tony Parker"}) )
        RETURN max(length(p)) AS maxL
      """
    Then the result should be, in any order, with relax comparison:
      | maxL |
      | 2    |
    When executing query:
      """
      MATCH (a:player)
      MATCH p = shortestPath( (a)-[e:like*..2]->(b) )
        WHERE id(b) IN ['xxx', 'zzz', 'yyy', 'Tim Duncan', 'Yao Ming']
        RETURN p
      """
    Then the result should be, in any order, with relax comparison:
      | p                                                                                                                                                                                                                                                                                               |
      | <("Rudy Gay" :player{age: 32, name: "Rudy Gay"})-[:like@0 {likeness: 70}]->("LaMarcus Aldridge" :player{age: 33, name: "LaMarcus Aldridge"})-[:like@0 {likeness: 75}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})>             |
      | <("Damian Lillard" :player{age: 28, name: "Damian Lillard"})-[:like@0 {likeness: 80}]->("LaMarcus Aldridge" :player{age: 33, name: "LaMarcus Aldridge"})-[:like@0 {likeness: 75}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})> |
      | <("Marco Belinelli" :player{age: 32, name: "Marco Belinelli"})-[:like@0 {likeness: 55}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})>                                                                                           |
      | <("Yao Ming" :player{age: 38, name: "Yao Ming"})-[:like@0 {likeness: 90}]->("Shaquille O'Neal" :player{age: 47, name: "Shaquille O'Neal"})-[:like@0 {likeness: 80}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})>               |
      | <("Aron Baynes" :player{age: 32, name: "Aron Baynes"})-[:like@0 {likeness: 80}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})>                                                                                                   |
      | <("Tiago Splitter" :player{age: 34, name: "Tiago Splitter"})-[:like@0 {likeness: 80}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})>                                                                                             |
      | <("Shaquille O'Neal" :player{age: 47, name: "Shaquille O'Neal"})-[:like@0 {likeness: 80}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})>                                                                                         |
      | <("Danny Green" :player{age: 31, name: "Danny Green"})-[:like@0 {likeness: 70}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})>                                                                                                   |
      | <("Boris Diaw" :player{age: 36, name: "Boris Diaw"})-[:like@0 {likeness: 80}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})>                                                                                                     |
      | <("Dejounte Murray" :player{age: 29, name: "Dejounte Murray"})-[:like@0 {likeness: 99}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})>                                                                                           |
      | <("Manu Ginobili" :player{age: 41, name: "Manu Ginobili"})-[:like@0 {likeness: 90}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})>                                                                                               |
      | <("Tony Parker" :player{age: 36, name: "Tony Parker"})-[:like@0 {likeness: 95}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})>                                                                                                   |
      | <("LaMarcus Aldridge" :player{age: 33, name: "LaMarcus Aldridge"})-[:like@0 {likeness: 75}]->("Tim Duncan" :bachelor{name: "Tim Duncan", speciality: "psychology"} :player{age: 42, name: "Tim Duncan"})>                                                                                       |

  Scenario: single shortestPaths5
    When executing query:
      """
      MATCH (a:player{name:"Tim Duncan"}), (b:team{name:"Lakers"})
        OPTIONAL MATCH p = shortestPath( (a)-[:like*]-(b) )
        RETURN
        CASE p is NULL
          WHEN true THEN -1
          ELSE length(p)
        END AS shortestPathLength
      """
    Then the result should be, in any order, with relax comparison:
      | shortestPathLength |
      | -1                 |

  Scenario: single shortestPaths Can Not find index
    When executing query:
      """
      MATCH p = shortestPath( (a)-[e*..5]-(b) )
        WHERE id(a) == 'Tim Duncan'
        RETURN p
      """
    Then the execution should be successful

  @skip
  Scenario: run fail in CI environment
    When executing query:
      """
      MATCH p = shortestPath( (a)-[e*..5]-(b) )
        WHERE id(a) == 'Tim Duncan' OR id(b) in ['Spurs', 'Tony Parker', 'Yao Ming']
        RETURN p
      """
    Then the result should be, in any order:
      | p                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |
      | <("Nets":team{name:"Nets"})<-[:serve@0{end_year:2009,start_year:2004}]-("Vince Carter":player{age:42,name:"Vince Carter"})-[:serve@0{end_year:2018,start_year:2017}]->("Kings":team{name:"Kings"})<-[:serve@0{end_year:2016,start_year:2015}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                              |
      | <("Clippers":team{name:"Clippers"})<-[:serve@0{end_year:2017,start_year:2011}]-("Chris Paul":player{age:33,name:"Chris Paul"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                     |
      | <("Heat":team{name:"Heat"})<-[:serve@0{end_year:2008,start_year:2004}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:like@0{likeness:80}]->("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:teammate@0{end_year:2016,start_year:2001}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                 |
      | <("Pistons":team{name:"Pistons"})<-[:serve@0{end_year:2017,start_year:2015}]-("Aron Baynes":player{age:32,name:"Aron Baynes"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                            |
      | <("Kobe Bryant":player{age:40,name:"Kobe Bryant"})<-[:like@0{likeness:90}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})-[:serve@0{end_year:2013,start_year:2013}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                          |
      | <("Jason Kidd":player{age:45,name:"Jason Kidd"})-[:serve@0{end_year:2001,start_year:1996}]->("Suns":team{name:"Suns"})<-[:serve@0{end_year:2008,start_year:2005}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:like@0{likeness:80}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                    |
      | <("Ben Simmons":player{age:22,name:"Ben Simmons"})-[:serve@0{end_year:2019,start_year:2016}]->("76ers":team{name:"76ers"})<-[:serve@0{end_year:2018,start_year:2018}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                      |
      | <("Tiago Splitter":player{age:34,name:"Tiago Splitter"})-[:serve@0{end_year:2015,start_year:2010}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                  |
      | <("Aron Baynes":player{age:32,name:"Aron Baynes"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                        |
      | <("Tracy McGrady":player{age:39,name:"Tracy McGrady"})-[:serve@0{end_year:2013,start_year:2013}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                    |
      | <("Jazz":team{name:"Jazz"})<-[:serve@0{end_year:2017,start_year:2016}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:like@0{likeness:80}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                               |
      | <("Hornets":team{name:"Hornets"})<-[:serve@0{end_year:2019,start_year:2018}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                                                                                                 |
      | <("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                                                                                           |
      | <("Clippers":team{name:"Clippers"})<-[:serve@0{end_year:2013,start_year:2012}]-("Grant Hill":player{age:46,name:"Grant Hill"})-[:like@0{likeness:90}]->("Tracy McGrady":player{age:39,name:"Tracy McGrady"})-[:serve@0{end_year:2013,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                           |
      | <("Nets":team{name:"Nets"})<-[:serve@0{end_year:2009,start_year:2004}]-("Vince Carter":player{age:42,name:"Vince Carter"})-[:like@0{likeness:90}]->("Tracy McGrady":player{age:39,name:"Tracy McGrady"})-[:serve@0{end_year:2013,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                               |
      | <("Heat":team{name:"Heat"})<-[:serve@0{end_year:2014,start_year:2010}]-("LeBron James":player{age:34,name:"LeBron James"})<-[:like@0{likeness:80}]-("Danny Green":player{age:31,name:"Danny Green"})-[:serve@0{end_year:2018,start_year:2010}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                   |
      | <("Jason Kidd":player{age:45,name:"Jason Kidd"})-[:serve@0{end_year:2001,start_year:1996}]->("Suns":team{name:"Suns"})<-[:serve@0{end_year:2008,start_year:2005}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:serve@0{end_year:2016,start_year:2012}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                      |
      | <("Ben Simmons":player{age:22,name:"Ben Simmons"})-[:serve@0{end_year:2019,start_year:2016}]->("76ers":team{name:"76ers"})<-[:serve@0{end_year:2018,start_year:2018}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                        |
      | <("Pistons":team{name:"Pistons"})<-[:serve@0{end_year:2017,start_year:2015}]-("Aron Baynes":player{age:32,name:"Aron Baynes"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                         |
      | <("Kobe Bryant":player{age:40,name:"Kobe Bryant"})<-[:like@0{likeness:90}]-("Paul Gasol":player{age:38,name:"Paul Gasol"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                             |
      | <("Jazz":team{name:"Jazz"})<-[:serve@0{end_year:2017,start_year:2016}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:serve@0{end_year:2016,start_year:2012}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                 |
      | <("Hornets":team{name:"Hornets"})<-[:serve@0{end_year:2012,start_year:2010}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                 |
      | <("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                                                             |
      | <("Tiago Splitter":player{age:34,name:"Tiago Splitter"})-[:serve@0{end_year:2015,start_year:2010}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                                                               |
      | <("Tony Parker":player{age:36,name:"Tony Parker"})-[:serve@0{end_year:2018,start_year:1999}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                                                                     |
      | <("Aron Baynes":player{age:32,name:"Aron Baynes"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                                                                     |
      | <("Tracy McGrady":player{age:39,name:"Tracy McGrady"})-[:serve@0{end_year:2013,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                                                                 |
      | <("Ben Simmons":player{age:22,name:"Ben Simmons"})-[:serve@0{end_year:2019,start_year:2016}]->("76ers":team{name:"76ers"})<-[:serve@0{end_year:2018,start_year:2018}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2010,start_year:2009}]->("Raptors":team{name:"Raptors"})<-[:serve@0{end_year:2000,start_year:1997}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>               |
      | <("JaVale McGee":player{age:31,name:"JaVale McGee"})<-[:like@0{likeness:100}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                                  |
      | <("Celtics":team{name:"Celtics"})<-[:serve@0{end_year:2011,start_year:2010}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                                   |
      | <("Jazz":team{name:"Jazz"})<-[:serve@0{end_year:2017,start_year:2016}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:serve@0{end_year:2008,start_year:2005}]->("Suns":team{name:"Suns"})<-[:serve@0{end_year:2009,start_year:2008}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                        |
      | <("Pistons":team{name:"Pistons"})<-[:serve@0{end_year:2000,start_year:1994}]-("Grant Hill":player{age:46,name:"Grant Hill"})-[:like@0{likeness:90}]->("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                 |
      | <("Nets":team{name:"Nets"})<-[:serve@0{end_year:2009,start_year:2004}]-("Vince Carter":player{age:42,name:"Vince Carter"})-[:like@0{likeness:90}]->("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                   |
      | <("Hornets":team{name:"Hornets"})<-[:serve@0{end_year:2018,start_year:2017}]-("Dwight Howard":player{age:33,name:"Dwight Howard"})-[:serve@0{end_year:2016,start_year:2013}]->("Rockets":team{name:"Rockets"})<-[:serve@0{end_year:2011,start_year:2002}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                          |
      | <("Clippers":team{name:"Clippers"})<-[:serve@0{end_year:2017,start_year:2011}]-("Chris Paul":player{age:33,name:"Chris Paul"})-[:serve@0{end_year:2021,start_year:2017}]->("Rockets":team{name:"Rockets"})<-[:serve@0{end_year:2011,start_year:2002}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                              |
      | <("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                 |
      | <("Tony Parker":player{age:36,name:"Tony Parker"})<-[:teammate@0{end_year:2016,start_year:2001}]-("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                   |
      | <("Aron Baynes":player{age:32,name:"Aron Baynes"})-[:like@0{likeness:80}]->("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                         |
      | <("Jason Kidd":player{age:45,name:"Jason Kidd"})-[:serve@0{end_year:2001,start_year:1996}]->("Suns":team{name:"Suns"})<-[:serve@0{end_year:2009,start_year:2008}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                              |
      | <("LeBron James":player{age:34,name:"LeBron James"})-[:serve@0{end_year:2014,start_year:2010}]->("Heat":team{name:"Heat"})<-[:serve@0{end_year:2008,start_year:2004}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                          |
      | <("Tiago Splitter":player{age:34,name:"Tiago Splitter"})-[:like@0{likeness:80}]->("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                   |
      | <("Kobe Bryant":player{age:40,name:"Kobe Bryant"})<-[:like@0{likeness:90}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                                           |
      | <("Heat":team{name:"Heat"})<-[:serve@0{end_year:2008,start_year:2004}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                                         |
      | <("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                                                                                                                     |
      | <("Kings":team{name:"Kings"})<-[:serve@0{end_year:2017,start_year:2013}]-("Rudy Gay":player{age:32,name:"Rudy Gay"})<-[:like@0{likeness:90}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                         |
      | <("DeAndre Jordan":player{age:30,name:"DeAndre Jordan"})-[:serve@0{end_year:2019,start_year:2018}]->("Mavericks":team{name:"Mavericks"})<-[:serve@0{end_year:2016,start_year:2015}]-("JaVale McGee":player{age:31,name:"JaVale McGee"})<-[:like@0{likeness:100}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                               |
      | <("Carmelo Anthony":player{age:34,name:"Carmelo Anthony"})<-[:like@0{likeness:90}]-("Chris Paul":player{age:33,name:"Chris Paul"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                 |
      | <("Lakers":team{name:"Lakers"})<-[:serve@0{end_year:2014,start_year:2008}]-("Paul Gasol":player{age:38,name:"Paul Gasol"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                |
      | <("Marc Gasol":player{age:34,name:"Marc Gasol"})-[:serve@0{end_year:2019,start_year:2019}]->("Raptors":team{name:"Raptors"})<-[:serve@0{end_year:2010,start_year:2009}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                    |
      | <("Klay Thompson":player{age:29,name:"Klay Thompson"})-[:serve@0{end_year:2019,start_year:2011}]->("Warriors":team{name:"Warriors"})<-[:serve@0{end_year:2009,start_year:2007}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                            |
      | <("Dwyane Wade":player{age:37,name:"Dwyane Wade"})-[:serve@0{end_year:2017,start_year:2016}]->("Bulls":team{name:"Bulls"})<-[:serve@0{end_year:2013,start_year:2012}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                      |
      | <("Kyle Anderson":player{age:25,name:"Kyle Anderson"})<-[:teammate@0{end_year:2016,start_year:2014}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                                                                         |
      | <("Carmelo Anthony":player{age:34,name:"Carmelo Anthony"})-[:like@0{likeness:90}]->("LeBron James":player{age:34,name:"LeBron James"})<-[:like@0{likeness:80}]-("Danny Green":player{age:31,name:"Danny Green"})-[:serve@0{end_year:2018,start_year:2010}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                       |
      | <("Klay Thompson":player{age:29,name:"Klay Thompson"})-[:serve@0{end_year:2019,start_year:2011}]->("Warriors":team{name:"Warriors"})<-[:serve@0{end_year:2009,start_year:2007}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                              |
      | <("Dwyane Wade":player{age:37,name:"Dwyane Wade"})-[:serve@0{end_year:2017,start_year:2016}]->("Bulls":team{name:"Bulls"})<-[:serve@0{end_year:2013,start_year:2012}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                        |
      | <("Marc Gasol":player{age:34,name:"Marc Gasol"})<-[:like@0{likeness:99}]-("Paul Gasol":player{age:38,name:"Paul Gasol"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                               |
      | <("Lakers":team{name:"Lakers"})<-[:serve@0{end_year:2014,start_year:2008}]-("Paul Gasol":player{age:38,name:"Paul Gasol"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                             |
      | <("Kyle Anderson":player{age:25,name:"Kyle Anderson"})-[:serve@0{end_year:2018,start_year:2014}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                                                                 |
      | <("Klay Thompson":player{age:29,name:"Klay Thompson"})-[:serve@0{end_year:2019,start_year:2011}]->("Warriors":team{name:"Warriors"})<-[:serve@0{end_year:2018,start_year:2016}]-("JaVale McGee":player{age:31,name:"JaVale McGee"})<-[:like@0{likeness:100}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                   |
      | <("Marc Gasol":player{age:34,name:"Marc Gasol"})-[:serve@0{end_year:2019,start_year:2019}]->("Raptors":team{name:"Raptors"})<-[:serve@0{end_year:2000,start_year:1997}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                              |
      | <("Kyle Anderson":player{age:25,name:"Kyle Anderson"})-[:serve@0{end_year:2018,start_year:2014}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2013,start_year:2013}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                            |
      | <("Dwyane Wade":player{age:37,name:"Dwyane Wade"})-[:serve@0{end_year:2016,start_year:2003}]->("Heat":team{name:"Heat"})<-[:serve@0{end_year:2008,start_year:2004}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                            |
      | <("Lakers":team{name:"Lakers"})<-[:serve@0{end_year:2004,start_year:1996}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                                     |
      | <("Carmelo Anthony":player{age:34,name:"Carmelo Anthony"})-[:serve@0{end_year:2019,start_year:2018}]->("Rockets":team{name:"Rockets"})<-[:serve@0{end_year:2011,start_year:2002}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                  |
      | <("Kristaps Porzingis":player{age:23,name:"Kristaps Porzingis"})<-[:like@0{likeness:90}]-("Luka Doncic":player{age:20,name:"Luka Doncic"})-[:like@0{likeness:80}]->("James Harden":player{age:29,name:"James Harden"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                             |
      | <("Blake Griffin":player{age:30,name:"Blake Griffin"})-[:like@0{likeness:-1}]->("Chris Paul":player{age:33,name:"Chris Paul"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                     |
      | <("Rockets":team{name:"Rockets"})<-[:serve@0{end_year:2010,start_year:2004}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})-[:serve@0{end_year:2013,start_year:2013}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                        |
      | <("Amar'e Stoudemire":player{age:36,name:"Amar'e Stoudemire"})-[:serve@0{end_year:2010,start_year:2002}]->("Suns":team{name:"Suns"})<-[:serve@0{end_year:2008,start_year:2005}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:like@0{likeness:80}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                      |
      | <("Rajon Rondo":player{age:33,name:"Rajon Rondo"})-[:serve@0{end_year:2017,start_year:2016}]->("Bulls":team{name:"Bulls"})<-[:serve@0{end_year:2013,start_year:2012}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                      |
      | <("Grizzlies":team{name:"Grizzlies"})<-[:serve@0{end_year:2019,start_year:2018}]-("Kyle Anderson":player{age:25,name:"Kyle Anderson"})<-[:teammate@0{end_year:2016,start_year:2014}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                         |
      | <("Paul Gasol":player{age:38,name:"Paul Gasol"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                          |
      | <("Kristaps Porzingis":player{age:23,name:"Kristaps Porzingis"})-[:serve@0{end_year:2020,start_year:2019}]->("Mavericks":team{name:"Mavericks"})<-[:serve@0{end_year:2014,start_year:2011}]-("Vince Carter":player{age:42,name:"Vince Carter"})-[:like@0{likeness:90}]->("Tracy McGrady":player{age:39,name:"Tracy McGrady"})-[:serve@0{end_year:2013,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                          |
      | <("Blake Griffin":player{age:30,name:"Blake Griffin"})-[:serve@0{end_year:2019,start_year:2018}]->("Pistons":team{name:"Pistons"})<-[:serve@0{end_year:2017,start_year:2015}]-("Aron Baynes":player{age:32,name:"Aron Baynes"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                        |
      | <("Amar'e Stoudemire":player{age:36,name:"Amar'e Stoudemire"})-[:serve@0{end_year:2010,start_year:2002}]->("Suns":team{name:"Suns"})<-[:serve@0{end_year:2008,start_year:2005}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:serve@0{end_year:2016,start_year:2012}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                        |
      | <("Rajon Rondo":player{age:33,name:"Rajon Rondo"})-[:serve@0{end_year:2017,start_year:2016}]->("Bulls":team{name:"Bulls"})<-[:serve@0{end_year:2013,start_year:2012}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                        |
      | <("Rockets":team{name:"Rockets"})<-[:serve@0{end_year:2010,start_year:2004}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})-[:serve@0{end_year:2013,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                     |
      | <("Grizzlies":team{name:"Grizzlies"})<-[:serve@0{end_year:2013,start_year:2006}]-("Rudy Gay":player{age:32,name:"Rudy Gay"})-[:serve@0{end_year:2019,start_year:2017}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                           |
      | <("Paul Gasol":player{age:38,name:"Paul Gasol"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                                                                       |
      | <("Kristaps Porzingis":player{age:23,name:"Kristaps Porzingis"})-[:serve@0{end_year:2020,start_year:2019}]->("Mavericks":team{name:"Mavericks"})<-[:serve@0{end_year:2016,start_year:2015}]-("JaVale McGee":player{age:31,name:"JaVale McGee"})<-[:like@0{likeness:100}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                       |
      | <("Grizzlies":team{name:"Grizzlies"})<-[:serve@0{end_year:2013,start_year:2006}]-("Rudy Gay":player{age:32,name:"Rudy Gay"})<-[:like@0{likeness:90}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                 |
      | <("Blake Griffin":player{age:30,name:"Blake Griffin"})-[:like@0{likeness:-1}]->("Chris Paul":player{age:33,name:"Chris Paul"})-[:serve@0{end_year:2021,start_year:2017}]->("Rockets":team{name:"Rockets"})<-[:serve@0{end_year:2011,start_year:2002}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                              |
      | <("Amar'e Stoudemire":player{age:36,name:"Amar'e Stoudemire"})-[:serve@0{end_year:2016,start_year:2015}]->("Heat":team{name:"Heat"})<-[:serve@0{end_year:2008,start_year:2004}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                |
      | <("Paul Gasol":player{age:38,name:"Paul Gasol"})-[:serve@0{end_year:2014,start_year:2008}]->("Lakers":team{name:"Lakers"})<-[:serve@0{end_year:2004,start_year:1996}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                          |
      | <("Rajon Rondo":player{age:33,name:"Rajon Rondo"})-[:serve@0{end_year:2019,start_year:2018}]->("Lakers":team{name:"Lakers"})<-[:serve@0{end_year:2004,start_year:1996}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                        |
      | <("Rockets":team{name:"Rockets"})<-[:serve@0{end_year:2011,start_year:2002}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                                                                                                                       |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:55}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2016,start_year:2015}]->("Kings":team{name:"Kings"})<-[:serve@0{end_year:2018,start_year:2017}]-("Vince Carter":player{age:42,name:"Vince Carter"})-[:serve@0{end_year:2009,start_year:2004}]->("Nets":team{name:"Nets"})>                                                            |
      | <("Thunders":team{name:"Thunders"})<-[:serve@0{end_year:2016,start_year:2007}]-("Kevin Durant":player{age:30,name:"Kevin Durant"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                 |
      | <("Kyrie Irving":player{age:26,name:"Kyrie Irving"})-[:like@0{likeness:13}]->("LeBron James":player{age:34,name:"LeBron James"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                   |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:serve@0{end_year:2016,start_year:1997}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2019,start_year:2016}]-("Paul Gasol":player{age:38,name:"Paul Gasol"})-[:like@0{likeness:90}]->("Kobe Bryant":player{age:40,name:"Kobe Bryant"})>                                                                                                                                              |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Tiago Splitter":player{age:34,name:"Tiago Splitter"})-[:serve@0{end_year:2017,start_year:2017}]->("76ers":team{name:"76ers"})<-[:serve@0{end_year:2019,start_year:2016}]-("Ben Simmons":player{age:22,name:"Ben Simmons"})>                                                                                                                                      |
      | <("LeBron James":player{age:34,name:"LeBron James"})<-[:like@0{likeness:80}]-("Danny Green":player{age:31,name:"Danny Green"})-[:serve@0{end_year:2018,start_year:2010}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                         |
      | <("Magic":team{name:"Magic"})<-[:serve@0{end_year:2004,start_year:2000}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})-[:serve@0{end_year:2013,start_year:2013}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                            |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Chris Paul":player{age:33,name:"Chris Paul"})-[:serve@0{end_year:2017,start_year:2011}]->("Clippers":team{name:"Clippers"})>                                                                                                                                                   |
      | <("Kings":team{name:"Kings"})<-[:serve@0{end_year:2017,start_year:2013}]-("Rudy Gay":player{age:32,name:"Rudy Gay"})-[:serve@0{end_year:2019,start_year:2017}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                   |
      | <("Stephen Curry":player{age:31,name:"Stephen Curry"})-[:serve@0{end_year:2019,start_year:2009}]->("Warriors":team{name:"Warriors"})<-[:serve@0{end_year:2009,start_year:2007}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                            |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:serve@0{end_year:2009,start_year:2008}]->("Suns":team{name:"Suns"})<-[:serve@0{end_year:2001,start_year:1996}]-("Jason Kidd":player{age:45,name:"Jason Kidd"})>                                                                                                                                      |
      | <("Celtics":team{name:"Celtics"})<-[:serve@0{end_year:2019,start_year:2017}]-("Aron Baynes":player{age:32,name:"Aron Baynes"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                         |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:serve@0{end_year:2008,start_year:2004}]->("Heat":team{name:"Heat"})>                                                                                                                                                                                                                                 |
      | <("Dwight Howard":player{age:33,name:"Dwight Howard"})-[:serve@0{end_year:2018,start_year:2017}]->("Hornets":team{name:"Hornets"})<-[:serve@0{end_year:2019,start_year:2018}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Aron Baynes":player{age:32,name:"Aron Baynes"})-[:serve@0{end_year:2017,start_year:2015}]->("Pistons":team{name:"Pistons"})>                                                                                                                                                                                                                                     |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:serve@0{end_year:2016,start_year:1997}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2013,start_year:2013}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})>                                                                                                                                                                                                                  |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:serve@0{end_year:2017,start_year:2016}]->("Jazz":team{name:"Jazz"})>                                                                                                                                                                                                                                             |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:55}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2012,start_year:2010}]->("Hornets":team{name:"Hornets"})>                                                                                                                                                                                                                             |
      | <("Damian Lillard":player{age:28,name:"Damian Lillard"})-[:like@0{likeness:80}]->("LaMarcus Aldridge":player{age:33,name:"LaMarcus Aldridge"})<-[:teammate@0{end_year:2018,start_year:2015}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                 |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})>                                                                                                                                                                                                                                                                                                         |
      | <("JaVale McGee":player{age:31,name:"JaVale McGee"})-[:serve@0{end_year:2018,start_year:2016}]->("Warriors":team{name:"Warriors"})<-[:serve@0{end_year:2009,start_year:2007}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Aron Baynes":player{age:32,name:"Aron Baynes"})>                                                                                                                                                                                                                                                                                                                 |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Tiago Splitter":player{age:34,name:"Tiago Splitter"})>                                                                                                                                                                                                                                                                                                           |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:teammate@0{end_year:2016,start_year:2001}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                           |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:55}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2009,start_year:2007}]->("Warriors":team{name:"Warriors"})<-[:serve@0{end_year:2019,start_year:2011}]-("Klay Thompson":player{age:29,name:"Klay Thompson"})>                                                                                                                          |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:55}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2010,start_year:2009}]->("Raptors":team{name:"Raptors"})<-[:serve@0{end_year:2019,start_year:2019}]-("Marc Gasol":player{age:34,name:"Marc Gasol"})>                                                                                                                                  |
      | <("DeAndre Jordan":player{age:30,name:"DeAndre Jordan"})-[:serve@0{end_year:2018,start_year:2008}]->("Clippers":team{name:"Clippers"})<-[:serve@0{end_year:2013,start_year:2012}]-("Grant Hill":player{age:46,name:"Grant Hill"})<-[:like@0{likeness:90}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})-[:serve@0{end_year:2013,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                        |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("LeBron James":player{age:34,name:"LeBron James"})<-[:like@0{likeness:90}]-("Carmelo Anthony":player{age:34,name:"Carmelo Anthony"})>                                                                                                                                           |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("LeBron James":player{age:34,name:"LeBron James"})<-[:like@0{likeness:90}]-("Dwyane Wade":player{age:37,name:"Dwyane Wade"})>                                                                                                                                                   |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:serve@0{end_year:2004,start_year:1996}]->("Lakers":team{name:"Lakers"})>                                                                                                                                                                                                                             |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:serve@0{end_year:2016,start_year:1997}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:2014}]-("Kyle Anderson":player{age:25,name:"Kyle Anderson"})>                                                                                                                                                                                                                  |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:like@0{likeness:100}]->("JaVale McGee":player{age:31,name:"JaVale McGee"})-[:serve@0{end_year:2016,start_year:2015}]->("Mavericks":team{name:"Mavericks"})<-[:serve@0{end_year:2020,start_year:2019}]-("Kristaps Porzingis":player{age:23,name:"Kristaps Porzingis"})>                               |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:serve@0{end_year:2016,start_year:1997}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2019,start_year:2017}]-("Rudy Gay":player{age:32,name:"Rudy Gay"})-[:serve@0{end_year:2013,start_year:2006}]->("Grizzlies":team{name:"Grizzlies"})>                                                                                                                                            |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Chris Paul":player{age:33,name:"Chris Paul"})<-[:like@0{likeness:-1}]-("Blake Griffin":player{age:30,name:"Blake Griffin"})>                                                                                                                                                   |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:serve@0{end_year:2009,start_year:2008}]->("Suns":team{name:"Suns"})<-[:serve@0{end_year:2010,start_year:2002}]-("Amar'e Stoudemire":player{age:36,name:"Amar'e Stoudemire"})>                                                                                                                        |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})-[:serve@0{end_year:2011,start_year:2002}]->("Rockets":team{name:"Rockets"})>                                                                                                                                                       |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:serve@0{end_year:2011,start_year:2010}]->("Celtics":team{name:"Celtics"})<-[:serve@0{end_year:2014,start_year:2006}]-("Rajon Rondo":player{age:33,name:"Rajon Rondo"})>                                                                                                                              |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:serve@0{end_year:2016,start_year:1997}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2019,start_year:2016}]-("Paul Gasol":player{age:38,name:"Paul Gasol"})>                                                                                                                                                                                                                        |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:55}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2009,start_year:2007}]->("Warriors":team{name:"Warriors"})<-[:serve@0{end_year:2019,start_year:2009}]-("Stephen Curry":player{age:31,name:"Stephen Curry"})>                                                                                                                          |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Tiago Splitter":player{age:34,name:"Tiago Splitter"})-[:serve@0{end_year:2017,start_year:2015}]->("Hawks":team{name:"Hawks"})<-[:serve@0{end_year:2017,start_year:2016}]-("Dwight Howard":player{age:33,name:"Dwight Howard"})>                                                                                                                                  |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Russell Westbrook":player{age:30,name:"Russell Westbrook"})-[:serve@0{end_year:2019,start_year:2008}]->("Thunders":team{name:"Thunders"})>                                                                                                                                     |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:serve@0{end_year:2011,start_year:2010}]->("Celtics":team{name:"Celtics"})<-[:serve@0{end_year:2019,start_year:2017}]-("Kyrie Irving":player{age:26,name:"Kyrie Irving"})>                                                                                                                            |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:serve@0{end_year:1996,start_year:1992}]->("Magic":team{name:"Magic"})>                                                                                                                                                                                                                               |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:teammate@0{end_year:2016,start_year:2015}]->("LaMarcus Aldridge":player{age:33,name:"LaMarcus Aldridge"})<-[:like@0{likeness:80}]-("Damian Lillard":player{age:28,name:"Damian Lillard"})>                                                                                                                                                                                               |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:like@0{likeness:100}]->("JaVale McGee":player{age:31,name:"JaVale McGee"})-[:serve@0{end_year:2016,start_year:2015}]->("Mavericks":team{name:"Mavericks"})<-[:serve@0{end_year:2019,start_year:1998}]-("Dirk Nowitzki":player{age:40,name:"Dirk Nowitzki"})>                                         |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("James Harden":player{age:29,name:"James Harden"})>                                                                                                                                                                                                                             |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:serve@0{end_year:2016,start_year:1997}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2017,start_year:2015}]-("Jonathon Simmons":player{age:29,name:"Jonathon Simmons"})>                                                                                                                                                                                                            |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:55}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2018,start_year:2018}]->("76ers":team{name:"76ers"})>                                                                                                                                                                                                                                 |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:teammate@0{end_year:2016,start_year:2015}]->("LaMarcus Aldridge":player{age:33,name:"LaMarcus Aldridge"})<-[:like@0{likeness:70}]-("Rudy Gay":player{age:32,name:"Rudy Gay"})>                                                                                                                                                                                                           |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:teammate@0{end_year:2016,start_year:2015}]->("LaMarcus Aldridge":player{age:33,name:"LaMarcus Aldridge"})>                                                                                                                                                                                                                                                                               |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:teammate@0{end_year:2016,start_year:2010}]->("Danny Green":player{age:31,name:"Danny Green"})>                                                                                                                                                                                                                                                                                           |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("LeBron James":player{age:34,name:"LeBron James"})<-[:like@0{likeness:90}]-("Carmelo Anthony":player{age:34,name:"Carmelo Anthony"})-[:serve@0{end_year:2017,start_year:2011}]->("Knicks":team{name:"Knicks"})>                                                                 |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:serve@0{end_year:2009,start_year:2008}]->("Suns":team{name:"Suns"})<-[:serve@0{end_year:1998,start_year:1996}]-("Steve Nash":player{age:45,name:"Steve Nash"})>                                                                                                                                      |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Russell Westbrook":player{age:30,name:"Russell Westbrook"})-[:like@0{likeness:90}]->("Paul George":player{age:28,name:"Paul George"})>                                                                                                                                         |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:like@0{likeness:100}]->("JaVale McGee":player{age:31,name:"JaVale McGee"})-[:serve@0{end_year:2012,start_year:2008}]->("Wizards":team{name:"Wizards"})>                                                                                                                                              |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:serve@0{end_year:2016,start_year:1997}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2015,start_year:2011}]-("Cory Joseph":player{age:27,name:"Cory Joseph"})>                                                                                                                                                                                                                      |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:55}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2009,start_year:2007}]->("Warriors":team{name:"Warriors"})>                                                                                                                                                                                                                           |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})>                                                                                                                                                                                                                                                                                                       |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:serve@0{end_year:2011,start_year:2010}]->("Celtics":team{name:"Celtics"})<-[:serve@0{end_year:2014,start_year:2006}]-("Rajon Rondo":player{age:33,name:"Rajon Rondo"})-[:serve@0{end_year:2018,start_year:2017}]->("Pelicans":team{name:"Pelicans"})>                                                |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:serve@0{end_year:2016,start_year:1997}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2019,start_year:2016}]-("Paul Gasol":player{age:38,name:"Paul Gasol"})-[:serve@0{end_year:2020,start_year:2019}]->("Bucks":team{name:"Bucks"})>                                                                                                                                                |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:serve@0{end_year:2011,start_year:2010}]->("Celtics":team{name:"Celtics"})<-[:serve@0{end_year:2012,start_year:2007}]-("Ray Allen":player{age:43,name:"Ray Allen"})>                                                                                                                                  |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Kevin Durant":player{age:30,name:"Kevin Durant"})>                                                                                                                                                                                                                             |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:serve@0{end_year:2016,start_year:1997}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2016,start_year:2015}]-("David West":player{age:38,name:"David West"})>                                                                                                                                                                                                                        |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:55}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2013,start_year:2012}]->("Bulls":team{name:"Bulls"})>                                                                                                                                                                                                                                 |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:teammate@0{end_year:2016,start_year:2002}]-("Manu Ginobili":player{age:41,name:"Manu Ginobili"})>                                                                                                                                                                                                                                                                                       |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:serve@0{end_year:2017,start_year:2016}]->("Jazz":team{name:"Jazz"})<-[:serve@0{end_year:2019,start_year:2017}]-("Ricky Rubio":player{age:28,name:"Ricky Rubio"})-[:serve@0{end_year:2017,start_year:2011}]->("Timberwolves":team{name:"Timberwolves"})>                                                          |
      | <("Thunders":team{name:"Thunders"})<-[:serve@0{end_year:2016,start_year:2007}]-("Kevin Durant":player{age:30,name:"Kevin Durant"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                   |
      | <("Kyrie Irving":player{age:26,name:"Kyrie Irving"})-[:serve@0{end_year:2017,start_year:2011}]->("Cavaliers":team{name:"Cavaliers"})<-[:serve@0{end_year:2010,start_year:2009}]-("Danny Green":player{age:31,name:"Danny Green"})-[:serve@0{end_year:2018,start_year:2010}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                      |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:serve@0{end_year:2016,start_year:1997}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2016,start_year:2015}]-("David West":player{age:38,name:"David West"})-[:serve@0{end_year:2015,start_year:2011}]->("Pacers":team{name:"Pacers"})>                                                                                                                                              |
      | <("Stephen Curry":player{age:31,name:"Stephen Curry"})-[:serve@0{end_year:2019,start_year:2009}]->("Warriors":team{name:"Warriors"})<-[:serve@0{end_year:2009,start_year:2007}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                              |
      | <("Dwight Howard":player{age:33,name:"Dwight Howard"})-[:serve@0{end_year:2018,start_year:2017}]->("Hornets":team{name:"Hornets"})<-[:serve@1{end_year:2017,start_year:2016}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:like@0{likeness:100}]->("JaVale McGee":player{age:31,name:"JaVale McGee"})-[:serve@0{end_year:2016,start_year:2015}]->("Mavericks":team{name:"Mavericks"})>                                                                                                                                          |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Chris Paul":player{age:33,name:"Chris Paul"})>                                                                                                                                                                                                                                 |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:55}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2018,start_year:2017}]->("Hawks":team{name:"Hawks"})>                                                                                                                                                                                                                                 |
      | <("Damian Lillard":player{age:28,name:"Damian Lillard"})-[:like@0{likeness:80}]->("LaMarcus Aldridge":player{age:33,name:"LaMarcus Aldridge"})-[:serve@0{end_year:2019,start_year:2015}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                         |
      | <("Magic":team{name:"Magic"})<-[:serve@0{end_year:2019,start_year:2017}]-("Jonathon Simmons":player{age:29,name:"Jonathon Simmons"})-[:serve@0{end_year:2017,start_year:2015}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                   |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:serve@0{end_year:2016,start_year:1997}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                   |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})>                                                                                                                                                                                                                                                                                                                   |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:serve@0{end_year:2016,start_year:1997}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2019,start_year:2016}]-("Paul Gasol":player{age:38,name:"Paul Gasol"})-[:serve@0{end_year:2020,start_year:2019}]->("Bucks":team{name:"Bucks"})<-[:serve@0{end_year:2019,start_year:2013}]-("Giannis Antetokounmpo":player{age:24,name:"Giannis Antetokounmpo"})>                               |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:serve@0{end_year:2017,start_year:2016}]->("Jazz":team{name:"Jazz"})<-[:serve@0{end_year:2019,start_year:2017}]-("Ricky Rubio":player{age:28,name:"Ricky Rubio"})>                                                                                                                                                |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:like@0{likeness:100}]->("JaVale McGee":player{age:31,name:"JaVale McGee"})-[:serve@0{end_year:2015,start_year:2012}]->("Nuggets":team{name:"Nuggets"})>                                                                                                                                              |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Russell Westbrook":player{age:30,name:"Russell Westbrook"})>                                                                                                                                                                                                                   |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:serve@0{end_year:2008,start_year:2005}]->("Suns":team{name:"Suns"})>                                                                                                                                                                                                                                             |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:teammate@0{end_year:2016,start_year:2010}]->("Danny Green":player{age:31,name:"Danny Green"})-[:serve@0{end_year:2010,start_year:2009}]->("Cavaliers":team{name:"Cavaliers"})>                                                                                                                                                                                                           |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:55}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})>                                                                                                                                                                                                                                                                                                         |
      | <("Damian Lillard":player{age:28,name:"Damian Lillard"})-[:like@0{likeness:80}]->("LaMarcus Aldridge":player{age:33,name:"LaMarcus Aldridge"})-[:serve@0{end_year:2019,start_year:2015}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2013,start_year:2013}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                    |
      | <("Stephen Curry":player{age:31,name:"Stephen Curry"})-[:serve@0{end_year:2019,start_year:2009}]->("Warriors":team{name:"Warriors"})<-[:serve@0{end_year:2018,start_year:2016}]-("JaVale McGee":player{age:31,name:"JaVale McGee"})<-[:like@0{likeness:100}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                   |
      | <("Thunders":team{name:"Thunders"})<-[:serve@0{end_year:2018,start_year:2017}]-("Carmelo Anthony":player{age:34,name:"Carmelo Anthony"})-[:serve@0{end_year:2019,start_year:2018}]->("Rockets":team{name:"Rockets"})<-[:serve@0{end_year:2011,start_year:2002}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                    |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("James Harden":player{age:29,name:"James Harden"})<-[:like@0{likeness:80}]-("Luka Doncic":player{age:20,name:"Luka Doncic"})>                                                                                                                                                   |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Tiago Splitter":player{age:34,name:"Tiago Splitter"})-[:serve@0{end_year:2017,start_year:2017}]->("76ers":team{name:"76ers"})<-[:serve@0{end_year:2019,start_year:2014}]-("Joel Embiid":player{age:25,name:"Joel Embiid"})>                                                                                                                                      |
      | <("Kyrie Irving":player{age:26,name:"Kyrie Irving"})-[:serve@0{end_year:2017,start_year:2011}]->("Cavaliers":team{name:"Cavaliers"})<-[:serve@0{end_year:2010,start_year:2009}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:serve@0{end_year:2009,start_year:2008}]->("Suns":team{name:"Suns"})<-[:serve@0{end_year:2012,start_year:2007}]-("Grant Hill":player{age:46,name:"Grant Hill"})>                                                                                                                                      |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:55}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2016,start_year:2015}]->("Kings":team{name:"Kings"})<-[:serve@0{end_year:2018,start_year:2017}]-("Vince Carter":player{age:42,name:"Vince Carter"})>                                                                                                                                  |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                   |
      | <("Magic":team{name:"Magic"})<-[:serve@0{end_year:2004,start_year:2000}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                                             |
      | <("Dwight Howard":player{age:33,name:"Dwight Howard"})-[:serve@0{end_year:2016,start_year:2013}]->("Rockets":team{name:"Rockets"})<-[:serve@0{end_year:2011,start_year:2002}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                      |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:teammate@0{end_year:2016,start_year:2015}]->("LaMarcus Aldridge":player{age:33,name:"LaMarcus Aldridge"})-[:serve@0{end_year:2015,start_year:2006}]->("Trail Blazers":team{name:"Trail Blazers"})>                                                                                                                                                                                       |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:teammate@0{end_year:2016,start_year:2010}]->("Danny Green":player{age:31,name:"Danny Green"})-[:serve@0{end_year:2019,start_year:2018}]->("Raptors":team{name:"Raptors"})>                                                                                                                                                                                                               |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:like@0{likeness:100}]->("JaVale McGee":player{age:31,name:"JaVale McGee"})-[:serve@0{end_year:2016,start_year:2015}]->("Mavericks":team{name:"Mavericks"})<-[:serve@0{end_year:2019,start_year:2018}]-("DeAndre Jordan":player{age:30,name:"DeAndre Jordan"})>                                       |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:like@0{likeness:100}]->("JaVale McGee":player{age:31,name:"JaVale McGee"})>                                                                                                                                                                                                                          |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Aron Baynes":player{age:32,name:"Aron Baynes"})-[:serve@0{end_year:2019,start_year:2017}]->("Celtics":team{name:"Celtics"})>                                                                                                                                                                                                                                     |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:55}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2016,start_year:2015}]->("Kings":team{name:"Kings"})>                                                                                                                                                                                                                                 |
      | <("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:teammate@0{end_year:2016,start_year:2010}]->("Danny Green":player{age:31,name:"Danny Green"})-[:like@0{likeness:80}]->("LeBron James":player{age:34,name:"LeBron James"})>                                                                                                                                                                                                               |
      | <("Dirk Nowitzki":player{age:40,name:"Dirk Nowitzki"})-[:like@0{likeness:10}]->("Dwyane Wade":player{age:37,name:"Dwyane Wade"})-[:like@0{likeness:90}]->("LeBron James":player{age:34,name:"LeBron James"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                       |
      | <("James Harden":player{age:29,name:"James Harden"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                               |
      | <("Jonathon Simmons":player{age:29,name:"Jonathon Simmons"})-[:serve@0{end_year:2017,start_year:2015}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                              |
      | <("Danny Green":player{age:31,name:"Danny Green"})<-[:like@0{likeness:60}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                 |
      | <("76ers":team{name:"76ers"})<-[:serve@0{end_year:2018,start_year:2018}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                   |
      | <("Rudy Gay":player{age:32,name:"Rudy Gay"})-[:like@0{likeness:70}]->("LaMarcus Aldridge":player{age:33,name:"LaMarcus Aldridge"})<-[:teammate@0{end_year:2018,start_year:2015}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                             |
      | <("LaMarcus Aldridge":player{age:33,name:"LaMarcus Aldridge"})<-[:teammate@0{end_year:2018,start_year:2015}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                                                                 |
      | <("Dirk Nowitzki":player{age:40,name:"Dirk Nowitzki"})-[:like@0{likeness:10}]->("Dwyane Wade":player{age:37,name:"Dwyane Wade"})-[:like@0{likeness:90}]->("LeBron James":player{age:34,name:"LeBron James"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})>                                                                                                                         |
      | <("James Harden":player{age:29,name:"James Harden"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                 |
      | <("76ers":team{name:"76ers"})<-[:serve@0{end_year:2019,start_year:2019}]-("Jonathon Simmons":player{age:29,name:"Jonathon Simmons"})-[:serve@0{end_year:2017,start_year:2015}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                   |
      | <("Danny Green":player{age:31,name:"Danny Green"})-[:serve@0{end_year:2018,start_year:2010}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                                                                     |
      | <("Rudy Gay":player{age:32,name:"Rudy Gay"})-[:serve@0{end_year:2019,start_year:2017}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                                                                           |
      | <("LaMarcus Aldridge":player{age:33,name:"LaMarcus Aldridge"})-[:serve@0{end_year:2019,start_year:2015}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                                                         |
      | <("Jonathon Simmons":player{age:29,name:"Jonathon Simmons"})-[:serve@0{end_year:2017,start_year:2015}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                                                           |
      | <("76ers":team{name:"76ers"})<-[:serve@0{end_year:2018,start_year:2018}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2010,start_year:2009}]->("Raptors":team{name:"Raptors"})<-[:serve@0{end_year:2000,start_year:1997}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                            |
      | <("Dirk Nowitzki":player{age:40,name:"Dirk Nowitzki"})-[:serve@0{end_year:2019,start_year:1998}]->("Mavericks":team{name:"Mavericks"})<-[:serve@0{end_year:2016,start_year:2015}]-("JaVale McGee":player{age:31,name:"JaVale McGee"})<-[:like@0{likeness:100}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                 |
      | <("Danny Green":player{age:31,name:"Danny Green"})<-[:teammate@0{end_year:2016,start_year:2010}]-("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                   |
      | <("LaMarcus Aldridge":player{age:33,name:"LaMarcus Aldridge"})<-[:teammate@0{end_year:2016,start_year:2015}]-("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                       |
      | <("Jonathon Simmons":player{age:29,name:"Jonathon Simmons"})-[:serve@0{end_year:2019,start_year:2017}]->("Magic":team{name:"Magic"})<-[:serve@0{end_year:1996,start_year:1992}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                |
      | <("Rudy Gay":player{age:32,name:"Rudy Gay"})<-[:like@0{likeness:90}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                                                 |
      | <("James Harden":player{age:29,name:"James Harden"})-[:serve@0{end_year:2019,start_year:2012}]->("Rockets":team{name:"Rockets"})<-[:serve@0{end_year:2011,start_year:2002}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                        |
      | <("Knicks":team{name:"Knicks"})<-[:serve@0{end_year:2017,start_year:2011}]-("Carmelo Anthony":player{age:34,name:"Carmelo Anthony"})-[:like@0{likeness:90}]->("LeBron James":player{age:34,name:"LeBron James"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                   |
      | <("Wizards":team{name:"Wizards"})<-[:serve@0{end_year:2019,start_year:2018}]-("Dwight Howard":player{age:33,name:"Dwight Howard"})-[:serve@0{end_year:2018,start_year:2017}]->("Hornets":team{name:"Hornets"})<-[:serve@0{end_year:2019,start_year:2018}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                    |
      | <("Paul George":player{age:28,name:"Paul George"})<-[:like@0{likeness:90}]-("Russell Westbrook":player{age:30,name:"Russell Westbrook"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                           |
      | <("Steve Nash":player{age:45,name:"Steve Nash"})-[:serve@0{end_year:1998,start_year:1996}]->("Suns":team{name:"Suns"})<-[:serve@0{end_year:2008,start_year:2005}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:like@0{likeness:80}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                    |
      | <("Cory Joseph":player{age:27,name:"Cory Joseph"})-[:serve@0{end_year:2015,start_year:2011}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                        |
      | <("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:like@0{likeness:80}]->("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:teammate@0{end_year:2016,start_year:2001}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                       |
      | <("Warriors":team{name:"Warriors"})<-[:serve@0{end_year:2009,start_year:2007}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                             |
      | <("Wizards":team{name:"Wizards"})<-[:serve@0{end_year:2019,start_year:2018}]-("Dwight Howard":player{age:33,name:"Dwight Howard"})-[:serve@0{end_year:2017,start_year:2016}]->("Hawks":team{name:"Hawks"})<-[:serve@0{end_year:2017,start_year:2015}]-("Tiago Splitter":player{age:34,name:"Tiago Splitter"})-[:serve@0{end_year:2015,start_year:2010}]->("Spurs":team{name:"Spurs"})>                                                                                                          |
      | <("Knicks":team{name:"Knicks"})<-[:serve@0{end_year:2017,start_year:2011}]-("Carmelo Anthony":player{age:34,name:"Carmelo Anthony"})-[:like@0{likeness:90}]->("LeBron James":player{age:34,name:"LeBron James"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})>                                                                                                                     |
      | <("Paul George":player{age:28,name:"Paul George"})-[:serve@0{end_year:2017,start_year:2010}]->("Pacers":team{name:"Pacers"})<-[:serve@0{end_year:2015,start_year:2011}]-("David West":player{age:38,name:"David West"})-[:serve@0{end_year:2016,start_year:2015}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                |
      | <("Steve Nash":player{age:45,name:"Steve Nash"})-[:serve@0{end_year:1998,start_year:1996}]->("Suns":team{name:"Suns"})<-[:serve@0{end_year:2008,start_year:2005}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:serve@0{end_year:2016,start_year:2012}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                      |
      | <("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})-[:like@0{likeness:80}]->("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})-[:serve@0{end_year:2016,start_year:1997}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                               |
      | <("Warriors":team{name:"Warriors"})<-[:serve@0{end_year:2009,start_year:2007}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                               |
      | <("Cory Joseph":player{age:27,name:"Cory Joseph"})-[:serve@0{end_year:2015,start_year:2011}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                                                                     |
      | <("Paul George":player{age:28,name:"Paul George"})-[:serve@0{end_year:2019,start_year:2017}]->("Thunders":team{name:"Thunders"})<-[:serve@0{end_year:2012,start_year:2009}]-("James Harden":player{age:29,name:"James Harden"})-[:serve@0{end_year:2019,start_year:2012}]->("Rockets":team{name:"Rockets"})<-[:serve@0{end_year:2011,start_year:2002}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                             |
      | <("Cory Joseph":player{age:27,name:"Cory Joseph"})-[:serve@0{end_year:2015,start_year:2011}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2013,start_year:2013}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                |
      | <("Knicks":team{name:"Knicks"})<-[:serve@0{end_year:2017,start_year:2011}]-("Carmelo Anthony":player{age:34,name:"Carmelo Anthony"})-[:serve@0{end_year:2019,start_year:2018}]->("Rockets":team{name:"Rockets"})<-[:serve@0{end_year:2011,start_year:2002}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                        |
      | <("Steve Nash":player{age:45,name:"Steve Nash"})-[:serve@0{end_year:2015,start_year:2012}]->("Lakers":team{name:"Lakers"})<-[:serve@0{end_year:2004,start_year:1996}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                          |
      | <("Warriors":team{name:"Warriors"})<-[:serve@0{end_year:2018,start_year:2016}]-("JaVale McGee":player{age:31,name:"JaVale McGee"})<-[:like@0{likeness:100}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                    |
      | <("Wizards":team{name:"Wizards"})<-[:serve@0{end_year:2012,start_year:2008}]-("JaVale McGee":player{age:31,name:"JaVale McGee"})<-[:like@0{likeness:100}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                      |
      | <("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                                                                                                               |
      | <("Pelicans":team{name:"Pelicans"})<-[:serve@0{end_year:2018,start_year:2017}]-("Rajon Rondo":player{age:33,name:"Rajon Rondo"})-[:serve@0{end_year:2016,start_year:2015}]->("Kings":team{name:"Kings"})<-[:serve@0{end_year:2016,start_year:2015}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                        |
      | <("Ray Allen":player{age:43,name:"Ray Allen"})<-[:like@0{likeness:100}]-("LeBron James":player{age:34,name:"LeBron James"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                        |
      | <("Bucks":team{name:"Bucks"})<-[:serve@0{end_year:2020,start_year:2019}]-("Paul Gasol":player{age:38,name:"Paul Gasol"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                  |
      | <("Kevin Durant":player{age:30,name:"Kevin Durant"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                               |
      | <("Bulls":team{name:"Bulls"})<-[:serve@0{end_year:2013,start_year:2012}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                   |
      | <("David West":player{age:38,name:"David West"})-[:serve@0{end_year:2016,start_year:2015}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                          |
      | <("Manu Ginobili":player{age:41,name:"Manu Ginobili"})<-[:teammate@0{end_year:2018,start_year:2002}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                                                                         |
      | <("Pelicans":team{name:"Pelicans"})<-[:serve@0{end_year:2018,start_year:2017}]-("Rajon Rondo":player{age:33,name:"Rajon Rondo"})-[:serve@0{end_year:2014,start_year:2006}]->("Celtics":team{name:"Celtics"})<-[:serve@0{end_year:2019,start_year:2017}]-("Aron Baynes":player{age:32,name:"Aron Baynes"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                              |
      | <("Ray Allen":player{age:43,name:"Ray Allen"})<-[:like@0{likeness:100}]-("LeBron James":player{age:34,name:"LeBron James"})<-[:like@0{likeness:80}]-("Danny Green":player{age:31,name:"Danny Green"})-[:serve@0{end_year:2018,start_year:2010}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                  |
      | <("Kevin Durant":player{age:30,name:"Kevin Durant"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                 |
      | <("Bucks":team{name:"Bucks"})<-[:serve@0{end_year:2020,start_year:2019}]-("Paul Gasol":player{age:38,name:"Paul Gasol"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                               |
      | <("Bulls":team{name:"Bulls"})<-[:serve@0{end_year:2013,start_year:2012}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                     |
      | <("David West":player{age:38,name:"David West"})-[:serve@0{end_year:2016,start_year:2015}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                                                                       |
      | <("Manu Ginobili":player{age:41,name:"Manu Ginobili"})-[:serve@0{end_year:2018,start_year:2002}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                                                                 |
      | <("Bulls":team{name:"Bulls"})<-[:serve@0{end_year:2017,start_year:2016}]-("Rajon Rondo":player{age:33,name:"Rajon Rondo"})-[:serve@0{end_year:2014,start_year:2006}]->("Celtics":team{name:"Celtics"})<-[:serve@0{end_year:2011,start_year:2010}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                              |
      | <("Pelicans":team{name:"Pelicans"})<-[:serve@0{end_year:2018,start_year:2017}]-("Rajon Rondo":player{age:33,name:"Rajon Rondo"})-[:serve@0{end_year:2014,start_year:2006}]->("Celtics":team{name:"Celtics"})<-[:serve@0{end_year:2011,start_year:2010}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                        |
      | <("Bucks":team{name:"Bucks"})<-[:serve@0{end_year:2003,start_year:1996}]-("Ray Allen":player{age:43,name:"Ray Allen"})-[:serve@0{end_year:2012,start_year:2007}]->("Celtics":team{name:"Celtics"})<-[:serve@0{end_year:2011,start_year:2010}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                  |
      | <("Kevin Durant":player{age:30,name:"Kevin Durant"})-[:serve@0{end_year:2019,start_year:2016}]->("Warriors":team{name:"Warriors"})<-[:serve@0{end_year:2018,start_year:2016}]-("JaVale McGee":player{age:31,name:"JaVale McGee"})<-[:like@0{likeness:100}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                     |
      | <("David West":player{age:38,name:"David West"})-[:serve@0{end_year:2016,start_year:2015}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2013,start_year:2013}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                  |
      | <("Manu Ginobili":player{age:41,name:"Manu Ginobili"})<-[:teammate@0{end_year:2016,start_year:2002}]-("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                               |
      | <("Ray Allen":player{age:43,name:"Ray Allen"})-[:serve@0{end_year:2014,start_year:2012}]->("Heat":team{name:"Heat"})<-[:serve@0{end_year:2008,start_year:2004}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                |
      | <("Timberwolves":team{name:"Timberwolves"})<-[:serve@0{end_year:2017,start_year:2011}]-("Ricky Rubio":player{age:28,name:"Ricky Rubio"})-[:serve@0{end_year:2019,start_year:2017}]->("Jazz":team{name:"Jazz"})<-[:serve@0{end_year:2017,start_year:2016}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:like@0{likeness:80}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                            |
      | <("Mavericks":team{name:"Mavericks"})<-[:serve@0{end_year:2015,start_year:2014}]-("Rajon Rondo":player{age:33,name:"Rajon Rondo"})-[:serve@0{end_year:2016,start_year:2015}]->("Kings":team{name:"Kings"})<-[:serve@0{end_year:2016,start_year:2015}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                      |
      | <("Pacers":team{name:"Pacers"})<-[:serve@0{end_year:2015,start_year:2011}]-("David West":player{age:38,name:"David West"})-[:serve@0{end_year:2016,start_year:2015}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                |
      | <("Chris Paul":player{age:33,name:"Chris Paul"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                   |
      | <("Hawks":team{name:"Hawks"})<-[:serve@0{end_year:2018,start_year:2017}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                   |
      | <("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:like@0{likeness:80}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                                                                                                     |
      | <("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                                                                                                     |
      | <("Timberwolves":team{name:"Timberwolves"})<-[:serve@0{end_year:2017,start_year:2011}]-("Ricky Rubio":player{age:28,name:"Ricky Rubio"})-[:serve@0{end_year:2019,start_year:2017}]->("Jazz":team{name:"Jazz"})<-[:serve@0{end_year:2017,start_year:2016}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:serve@0{end_year:2016,start_year:2012}]->("Spurs":team{name:"Spurs"})>                                                                                                              |
      | <("Mavericks":team{name:"Mavericks"})<-[:serve@0{end_year:2014,start_year:2011}]-("Vince Carter":player{age:42,name:"Vince Carter"})-[:like@0{likeness:90}]->("Tracy McGrady":player{age:39,name:"Tracy McGrady"})-[:serve@0{end_year:2013,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                     |
      | <("Chris Paul":player{age:33,name:"Chris Paul"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                     |
      | <("Hawks":team{name:"Hawks"})<-[:serve@0{end_year:2018,start_year:2017}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                     |
      | <("Pacers":team{name:"Pacers"})<-[:serve@0{end_year:2019,start_year:2017}]-("Cory Joseph":player{age:27,name:"Cory Joseph"})-[:serve@0{end_year:2015,start_year:2011}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                           |
      | <("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:serve@0{end_year:2016,start_year:2012}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                                                                       |
      | <("Pacers":team{name:"Pacers"})<-[:serve@0{end_year:2019,start_year:2017}]-("Cory Joseph":player{age:27,name:"Cory Joseph"})-[:serve@0{end_year:2017,start_year:2015}]->("Raptors":team{name:"Raptors"})<-[:serve@0{end_year:2000,start_year:1997}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                  |
      | <("Hawks":team{name:"Hawks"})<-[:serve@0{end_year:2017,start_year:2016}]-("Dwight Howard":player{age:33,name:"Dwight Howard"})-[:serve@0{end_year:2016,start_year:2013}]->("Rockets":team{name:"Rockets"})<-[:serve@0{end_year:2011,start_year:2002}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                              |
      | <("Mavericks":team{name:"Mavericks"})<-[:serve@0{end_year:2016,start_year:2015}]-("JaVale McGee":player{age:31,name:"JaVale McGee"})<-[:like@0{likeness:100}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                  |
      | <("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:like@0{likeness:80}]->("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                           |
      | <("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2013,start_year:2013}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                                             |
      | <("Chris Paul":player{age:33,name:"Chris Paul"})-[:serve@0{end_year:2021,start_year:2017}]->("Rockets":team{name:"Rockets"})<-[:serve@0{end_year:2011,start_year:2002}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                            |
      | <("Giannis Antetokounmpo":player{age:24,name:"Giannis Antetokounmpo"})-[:serve@0{end_year:2019,start_year:2013}]->("Bucks":team{name:"Bucks"})<-[:serve@0{end_year:2020,start_year:2019}]-("Paul Gasol":player{age:38,name:"Paul Gasol"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                 |
      | <("Nuggets":team{name:"Nuggets"})<-[:serve@0{end_year:2011,start_year:2003}]-("Carmelo Anthony":player{age:34,name:"Carmelo Anthony"})-[:like@0{likeness:90}]->("LeBron James":player{age:34,name:"LeBron James"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                 |
      | <("Ricky Rubio":player{age:28,name:"Ricky Rubio"})-[:serve@0{end_year:2019,start_year:2017}]->("Jazz":team{name:"Jazz"})<-[:serve@0{end_year:2017,start_year:2016}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:like@0{likeness:80}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                  |
      | <("Cavaliers":team{name:"Cavaliers"})<-[:serve@0{end_year:2010,start_year:2009}]-("Danny Green":player{age:31,name:"Danny Green"})-[:like@0{likeness:83}]->("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                 |
      | <("Russell Westbrook":player{age:30,name:"Russell Westbrook"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                     |
      | <("Suns":team{name:"Suns"})<-[:serve@0{end_year:2008,start_year:2005}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:like@0{likeness:80}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                               |
      | <("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                                                                                           |
      | <("Nuggets":team{name:"Nuggets"})<-[:serve@0{end_year:2011,start_year:2003}]-("Carmelo Anthony":player{age:34,name:"Carmelo Anthony"})-[:like@0{likeness:90}]->("LeBron James":player{age:34,name:"LeBron James"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})>                                                                                                                   |
      | <("Giannis Antetokounmpo":player{age:24,name:"Giannis Antetokounmpo"})-[:serve@0{end_year:2019,start_year:2013}]->("Bucks":team{name:"Bucks"})<-[:serve@0{end_year:2020,start_year:2019}]-("Paul Gasol":player{age:38,name:"Paul Gasol"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                              |
      | <("Ricky Rubio":player{age:28,name:"Ricky Rubio"})-[:serve@0{end_year:2019,start_year:2017}]->("Jazz":team{name:"Jazz"})<-[:serve@0{end_year:2017,start_year:2016}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:serve@0{end_year:2016,start_year:2012}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                    |
      | <("Russell Westbrook":player{age:30,name:"Russell Westbrook"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                       |
      | <("Suns":team{name:"Suns"})<-[:serve@0{end_year:2008,start_year:2005}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:serve@0{end_year:2016,start_year:2012}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                 |
      | <("Cavaliers":team{name:"Cavaliers"})<-[:serve@0{end_year:2010,start_year:2009}]-("Danny Green":player{age:31,name:"Danny Green"})-[:serve@0{end_year:2018,start_year:2010}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                     |
      | <("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                                                                                             |
      | <("Ricky Rubio":player{age:28,name:"Ricky Rubio"})-[:serve@0{end_year:2019,start_year:2017}]->("Jazz":team{name:"Jazz"})<-[:serve@0{end_year:2017,start_year:2016}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:serve@0{end_year:2008,start_year:2005}]->("Suns":team{name:"Suns"})<-[:serve@0{end_year:2009,start_year:2008}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                           |
      | <("Giannis Antetokounmpo":player{age:24,name:"Giannis Antetokounmpo"})-[:serve@0{end_year:2019,start_year:2013}]->("Bucks":team{name:"Bucks"})<-[:serve@0{end_year:2003,start_year:1996}]-("Ray Allen":player{age:43,name:"Ray Allen"})-[:serve@0{end_year:2012,start_year:2007}]->("Celtics":team{name:"Celtics"})<-[:serve@0{end_year:2011,start_year:2010}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})> |
      | <("Russell Westbrook":player{age:30,name:"Russell Westbrook"})<-[:like@0{likeness:80}]-("James Harden":player{age:29,name:"James Harden"})-[:serve@0{end_year:2019,start_year:2012}]->("Rockets":team{name:"Rockets"})<-[:serve@0{end_year:2011,start_year:2002}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                  |
      | <("Nuggets":team{name:"Nuggets"})<-[:serve@0{end_year:2015,start_year:2012}]-("JaVale McGee":player{age:31,name:"JaVale McGee"})<-[:like@0{likeness:100}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                      |
      | <("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:55}]->("Tim Duncan":player{age:42,name:"Tim Duncan"}:bachelor{name:"Tim Duncan",speciality:"psychology"})<-[:like@0{likeness:80}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                 |
      | <("Suns":team{name:"Suns"})<-[:serve@0{end_year:2009,start_year:2008}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                                         |
      | <("Cavaliers":team{name:"Cavaliers"})<-[:serve@0{end_year:2010,start_year:2009}]-("Shaquille O'Neal":player{age:47,name:"Shaquille O'Neal"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                               |
      | <("Luka Doncic":player{age:20,name:"Luka Doncic"})-[:like@0{likeness:80}]->("James Harden":player{age:29,name:"James Harden"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                     |
      | <("Yao Ming":player{age:38,name:"Yao Ming"})-[:like@0{likeness:90}]->("Tracy McGrady":player{age:39,name:"Tracy McGrady"})-[:serve@0{end_year:2013,start_year:2013}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                |
      | <("Grant Hill":player{age:46,name:"Grant Hill"})-[:serve@0{end_year:2012,start_year:2007}]->("Suns":team{name:"Suns"})<-[:serve@0{end_year:2008,start_year:2005}]-("Boris Diaw":player{age:36,name:"Boris Diaw"})-[:like@0{likeness:80}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                    |
      | <("Vince Carter":player{age:42,name:"Vince Carter"})-[:serve@0{end_year:2019,start_year:2018}]->("Hawks":team{name:"Hawks"})<-[:serve@0{end_year:2018,start_year:2017}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                    |
      | <("Joel Embiid":player{age:25,name:"Joel Embiid"})-[:serve@0{end_year:2019,start_year:2014}]->("76ers":team{name:"76ers"})<-[:serve@0{end_year:2018,start_year:2018}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                      |
      | <("Raptors":team{name:"Raptors"})<-[:serve@0{end_year:2010,start_year:2009}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                               |
      | <("Trail Blazers":team{name:"Trail Blazers"})<-[:serve@0{end_year:2015,start_year:2006}]-("LaMarcus Aldridge":player{age:33,name:"LaMarcus Aldridge"})<-[:teammate@0{end_year:2018,start_year:2015}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                         |
      | <("Luka Doncic":player{age:20,name:"Luka Doncic"})-[:like@0{likeness:80}]->("James Harden":player{age:29,name:"James Harden"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:serve@0{end_year:2019,start_year:2016}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                       |
      | <("Joel Embiid":player{age:25,name:"Joel Embiid"})-[:serve@0{end_year:2019,start_year:2014}]->("76ers":team{name:"76ers"})<-[:serve@0{end_year:2018,start_year:2018}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                        |
      | <("Grant Hill":player{age:46,name:"Grant Hill"})<-[:like@0{likeness:90}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})-[:serve@0{end_year:2013,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                         |
      | <("Vince Carter":player{age:42,name:"Vince Carter"})-[:like@0{likeness:90}]->("Tracy McGrady":player{age:39,name:"Tracy McGrady"})-[:serve@0{end_year:2013,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                     |
      | <("Yao Ming":player{age:38,name:"Yao Ming"})-[:like@0{likeness:90}]->("Tracy McGrady":player{age:39,name:"Tracy McGrady"})-[:serve@0{end_year:2013,start_year:2013}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                             |
      | <("Trail Blazers":team{name:"Trail Blazers"})<-[:serve@0{end_year:2015,start_year:2006}]-("LaMarcus Aldridge":player{age:33,name:"LaMarcus Aldridge"})-[:serve@0{end_year:2019,start_year:2015}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                 |
      | <("Raptors":team{name:"Raptors"})<-[:serve@0{end_year:2017,start_year:2015}]-("Cory Joseph":player{age:27,name:"Cory Joseph"})-[:serve@0{end_year:2015,start_year:2011}]->("Spurs":team{name:"Spurs"})>                                                                                                                                                                                                                                                                                         |
      | <("Joel Embiid":player{age:25,name:"Joel Embiid"})-[:serve@0{end_year:2019,start_year:2014}]->("76ers":team{name:"76ers"})<-[:serve@0{end_year:2018,start_year:2018}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:serve@0{end_year:2010,start_year:2009}]->("Raptors":team{name:"Raptors"})<-[:serve@0{end_year:2000,start_year:1997}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>               |
      | <("Trail Blazers":team{name:"Trail Blazers"})<-[:serve@0{end_year:2015,start_year:2006}]-("LaMarcus Aldridge":player{age:33,name:"LaMarcus Aldridge"})-[:serve@0{end_year:2019,start_year:2015}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2013,start_year:2013}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                            |
      | <("Luka Doncic":player{age:20,name:"Luka Doncic"})-[:like@0{likeness:80}]->("James Harden":player{age:29,name:"James Harden"})-[:serve@0{end_year:2019,start_year:2012}]->("Rockets":team{name:"Rockets"})<-[:serve@0{end_year:2011,start_year:2002}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                              |
      | <("Grant Hill":player{age:46,name:"Grant Hill"})<-[:like@0{likeness:90}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                                             |
      | <("Vince Carter":player{age:42,name:"Vince Carter"})-[:like@0{likeness:90}]->("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                                         |
      | <("Raptors":team{name:"Raptors"})<-[:serve@0{end_year:2000,start_year:1997}]-("Tracy McGrady":player{age:39,name:"Tracy McGrady"})<-[:like@0{likeness:90}]-("Yao Ming":player{age:38,name:"Yao Ming"})>                                                                                                                                                                                                                                                                                         |
      | <("DeAndre Jordan":player{age:30,name:"DeAndre Jordan"})-[:serve@0{end_year:2018,start_year:2008}]->("Clippers":team{name:"Clippers"})<-[:serve@0{end_year:2017,start_year:2011}]-("Chris Paul":player{age:33,name:"Chris Paul"})-[:serve@0{end_year:2011,start_year:2005}]->("Hornets":team{name:"Hornets"})<-[:serve@0{end_year:2019,start_year:2018}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                     |
      | <("Celtics":team{name:"Celtics"})<-[:serve@0{end_year:2019,start_year:2017}]-("Aron Baynes":player{age:32,name:"Aron Baynes"})-[:serve@0{end_year:2015,start_year:2013}]->("Spurs":team{name:"Spurs"})<-[:serve@0{end_year:2018,start_year:1999}]-("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                            |
      | <("JaVale McGee":player{age:31,name:"JaVale McGee"})-[:serve@0{end_year:2018,start_year:2016}]->("Warriors":team{name:"Warriors"})<-[:serve@0{end_year:2009,start_year:2007}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                              |
      | <("LeBron James":player{age:34,name:"LeBron James"})<-[:like@0{likeness:99}]-("Dejounte Murray":player{age:29,name:"Dejounte Murray"})-[:like@0{likeness:99}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                               |
      | <("Kings":team{name:"Kings"})<-[:serve@0{end_year:2016,start_year:2015}]-("Marco Belinelli":player{age:32,name:"Marco Belinelli"})-[:like@0{likeness:50}]->("Tony Parker":player{age:36,name:"Tony Parker"})>                                                                                                                                                                                                                                                                                   |
