# Quick Start

This guide helps you walk through the process of using **Nebula Graph**. We will show you how to [create and use a graph space](#creating-and-using-a-graph-space), [define the schema for your data](#defining-the-schema-for-your-data), [insert data](#inserting-data), [fetch data](#fetching-data), [update data](#updating-data) and [delete data](#deleting-data). At the end we will show you how to [insert multiple data](#batch-inserting) with a `.ngql` file.

## Overview

We will show you how to use the **Nebula Graph** database based on the relations between different vertices in the following figure:

![image](https://user-images.githubusercontent.com/40747875/69605530-4c83dd00-105b-11ea-9ecf-219af8545b16.png)

In the above figure, there are two tags (**player**, **team**) and two edge types (**serve** and **follow**).

### Creating and Using a Graph Space

A graph space in **Nebula Graph** is similar to an individual database that you create in traditional databases such as MySQL. First, you need to create a space and use it before can do any other operations.

You can create and use a graph space by the following steps:

1. Enter the following statement to create a graph space:

```ngql
nebula> CREATE SPACE nba(partition_num=10, replica_factor=1);
```

**Note**:

* `partition_num` specifies the number of partitions in one replica.
* `replica_factor` specifies the number of replicas in the cluster.

2. Enter the following statement to use the graph space:

```ngql
nebula> USE nba;
```

Now you can check the space you just created by the following statement:

```ngql
nebula> SHOW SPACES;
```

The following information is returned:

```
========
| Name |
========
| nba  |
--------
```

### Defining the Schema for Your Data

In **Nebula Graph**, we classify different vertices with similar properties into one group which is named a tag. The `CREATE TAG` statement defines a tag with a tag name followed by properties and the property types enclosed in parentheses. The `CREATE EDGE` statement defines an edge type with a type name, followed by properties and the property types enclosed in parentheses.

You can create tags and edge types by the following steps:

1. Enter the following statement to create the **player** tag:

```ngql
nebula> CREATE TAG player (name string, age int);
```

2. Enter the following statement to create the **team** tag:

```ngql
nebula> CREATE TAG team (name string);
```

3. Enter the following statement to create the **follow** edge type:

```ngql
nebula> CREATE EDGE follow(degree int);
```

4. Enter the following statement to create the **serve** edge type:

```ngql
nebula> CREATE EDGE serve(start_year int, end_year int);
```

Now you can check the tags and edge types you just created.

To show the tags you just created, enter the following statement:

```ngql
nebula> SHOW TAGS;
```

The following information is returned:

```
============
| Name     |
============
| player   |
------------
| team     |
------------
```

To show the edge types you just created, enter the following statement:

```ngql
nebula> SHOW EDGES;
```

The following information is returned:

```
==========
| Name   |
==========
| serve  |
----------
| follow |
----------
```

To show the properties of the **player** tag, enter the following statement:

```ngql
nebula> DESCRIBE TAG player;
```

The following information is returned:

```
===================
| Field  | Type   |
===================
| name   | string |
-------------------
| age    | int    |
-------------------
```

To show the properties of the **follow** edge type, enter the following statement:

```ngql
nebula> DESCRIBE EDGE follow;
```

The following information is returned:

```
=====================
| Field    | Type   |
=====================
| degree   | int    |
---------------------
```

### Inserting Data

You can insert vertices and edges based on relations in the [illustration figure](#overview).

#### Inserting Vertices

The `INSERT VERTEX` statement inserts a vertex by specifying the vertex tag, properties, vertex ID and property values.

You can insert some vertices by the following statements:

```ngql
nebula> INSERT VERTEX player(name, age) VALUES 100:("Tim Duncan", 42);
nebula> INSERT VERTEX player(name, age) VALUES 101:("Tony Parker", 36);
nebula> INSERT VERTEX player(name, age) VALUES 102:("LaMarcus Aldridge", 33);
nebula> INSERT VERTEX team(name) VALUES 200:("Warriors");
nebula> INSERT VERTEX team(name) VALUES 201:("Nuggets");
nebula> INSERT VERTEX player(name, age) VALUES 121:("Useless", 60);
```

**Note**:

1. In the above vertices inserted, the number after the keyword `VALUES` is the vertex ID (abbreviated for `VID`). The `VID` must be unique in the space.

2. The last vertex inserted will be deleted in the [deleting data](#deleting-data) section.

3. If you want to insert multiple vertices for the same tag by a single `INSERT VERTEX` operation, you can enter the following statement:

```ngql
nebula> INSERT VERTEX player(name, age) VALUES 100:("Tim Duncan", 42), \
101:("Tony Parker", 36), 102:("LaMarcus Aldridge", 33);
```


#### Inserting Edges

The `INSERT EDGE` statement inserts an edge by specifying the edge type name, properties, source vertex ID and target vertex ID, and property values.

You can insert some edges by the following statements:

```ngql
nebula> INSERT EDGE follow(degree) VALUES 100 -> 101:(95);
nebula> INSERT EDGE follow(degree) VALUES 100 -> 102:(90);
nebula> INSERT EDGE follow(degree) VALUES 102 -> 101:(75);
nebula> INSERT EDGE serve(start_year, end_year) VALUES 100 -> 200:(1997, 2016);
nebula> INSERT EDGE serve(start_year, end_year) VALUES 101 -> 201:(1999, 2018);

```

**Note**: If you want to insert multiple edges for the same edge type by a single `INSERT EDGES` operation, you can enter the following statement:

```ngql
INSERT EDGE follow(degree) VALUES 100 -> 101:(95),100 -> 102:(90),102 -> 101:(75);
```

### Fetching Data

After you insert some data in **Nebula Graph**, you can retrieve any data from your graph space.

The `FETCH PROP ON` statement retrieve data from your graph space. If you want to fetch vertex data, you must specify the vertex tag and vertex ID; if you want to fetch edge data, you must specify the edge type name, source vertex ID and target vertex ID.

To fetch the data of the player whose `VID` is `100`, enter the following statement:

```ngql
nebula> FETCH PROP ON player 100;
```

The following information is returned:

```
============================
| player.name | player.age |
============================
| Tim Duncan  | 42         |
----------------------------
```

To fetch the data of the **serve** edge between `VID` `100` and `VID` `200`, enter the following statement:

```ngql
nebula>FETCH PROP ON serve 100 -> 200;
```

The following information is returned:

```
=====================================
| serve.start_year | serve.end_year |
=====================================
| 1997             | 2016           |
-------------------------------------
```

### Updating Data

You can update the vertices and edges you just inserted.

#### Updating Vertices

The `UPDATE VERTEX` statement updates data for your vertex by selecting the vertex that you want to update and then setting the property value with an equal sign to assign it a new value.

The following example shows you how to change the `name` value of `VID` `100` from `Tim Duncan` to `Tim`.

Enter the following statement to update the `name` value:

```ngql
nebula> UPDATE VERTEX 100 SET player.name = "Tim";
```

To check whether the `name` value is updated, enter the following statement:

```ngql
nebula> FETCH PROP ON player 100;
```

The following information is displayed:

```
============================
| player.name | player.age |
============================
| Tim         | 41         |
----------------------------
```

#### Updating Edges

The `UPDATE EDGE` statement updates data for your edge by specifying the source vertex ID and the target vertex ID of the edge and then setting the property value with an equal sign to assign it a new value.

The following example shows you how to change the value of the `degree` property in the **follow** edge between `VID` `100` and `VID` `101`. Now we change the `degree` property from `95` to `96`.

Enter the following statement to update the `degree` value:

```ngql
nebula> UPDATE EDGE 100 -> 101 OF follow SET degree = 96;
```

To check whether the `degree` value is updated, enter the following statement:

```ngql
nebula> FETCH PROP ON follow 100 -> 101;
```

The following information is returned:

```
=================
| follow.degree |
=================
| 96            |
-----------------
```

### Deleting Data

If you have some data that you do not need, you can delete it from your graph space.

#### Deleting Vertices

You can delete any vertex from your graph space. The `DELETE VERTEX` statement deletes a vertex by specifying the vertex ID.

To delete a vertex whose `VID` is `121`, enter the following statement:

```ngql
nebula> DELETE VERTEX 121;
```

To check whether the vertex is deleted, enter the following statement;

```ngql
nebula> FETCH PROP ON player 121;
```

The following information is returned:

```
Execution succeeded (Time spent: 1571/1910 us)
```

**Note**: The above information with an empty return result indicates the query operation is successful but no data is queried from your graph space because the data is deleted.

#### Deleting Edges

You can delete any edge from your graph space. The `DELETE EDGE` statement deletes an edge by specifying the edge type name and the source vertex ID and target vertex ID.

To delete a **follow** edge between `VID` `100` and `VID` `200`, enter the following statement:

```ngql
nebula> DELETE EDGE follow 100 -> 200;
```

**Note**: If you delete a vertex, all the out-going and in-coming edges of this vertex are deleted.

### Sample Queries

This section gives more query examples for your reference.

**Example 1**. Find the vertices that `VID` `100` follows.

Enter the following statement:

```ngql
nebula> GO FROM 100 OVER follow;
```

The following information is returned:

```
===============
| follow._dst |
===============
| 101         |
---------------
| 102         |
---------------
```

**Example 2**. Find the vertex that `VID` `100` follows, whose age is greater than `35`.
Return his name and age, and set the column names to **Teammate** and **Age** respectively.

Enter the following statement:

```ngql
nebula> GO FROM 100 OVER follow WHERE $$.player.age >= 35 \  
YIELD $$.player.name AS Teammate, $$.player.age AS Age;
```

The following information is returned:

```
=====================
| Teammate    | Age |
=====================
| Tony Parker | 36  |
---------------------
```

**Note**:

* `YIELD` specifies what values or results you want to return from the query.
* `$$` represents the target vertex.
* `\` represents a line break.

**Example 3**. Find the team which is served by the player who is followed by `100`.

There are two ways to get the same result. First, we can use a `pipe` to retrieve the team. Then we use a `temporary variable` to retrieve the same team.

Enter the following statement with a `pipe`:

```ngql
GO FROM 100 OVER follow YIELD follow._dst AS id | \  
GO FROM $-.id OVER serve YIELD $$.team.name \
AS Team, $^.player.name AS Player;
```

The following information is returned.

```
===============================
| Team    | Player            |
===============================
| Nuggets | Tony Parker       |
-------------------------------
```

Enter the following statement with a `temporary variable`:

```ngql
$var=GO FROM 100 OVER follow YIELD follow._dst AS id; \  
GO FROM $var.id OVER serve YIELD $$.team.name \
AS Team, $^.player.name AS Player;
```

The following information is returned.

```
===============================
| Team    | Player            |
===============================
| Nuggets | Tony Parker       |
-------------------------------
```

**Note**:

* `$^` represents the source vertex.
* `|` denotes a pipe. The output of the previous query acts as an input to the next query.
* `$-` refers to the input stream.
* The second approach adopts a user-defined variable `$var`. The scope of this variable is within the compound statement.

## Batch Inserting

To insert multiple data, you can put all the DDL (Data Definition Language) statements in a `.ngql` file as follows.

```ngql
CREATE SPACE nba(partition_num=10, replica_factor=1);
USE nba;
CREATE TAG player(name string, age int);
CREATE TAG team(name string);
CREATE EDGE follow(degree int);
CREATE EDGE serve(start_year int, end_year int);
```

* If you install **Nebula Graph** by compiling the source code, you can batch write to console by the following command:

```bash
$ cat schema.ngql | ./bin/nebula -u user -p password
```

* If you are using **Nebula Graph** by docker-compose, you can batch write to console by the following command:

```bash
$ cat nba.ngql | sudo docker run --rm -i --network=host \  
vesoft/nebula-console:nightly --addr=127.0.0.1 --port=3699
```

**Note**:

* You must change the IP address and the port number to yours.
* You can download the `nba.ngql` file [here](https://nebula-graph.oss-accelerate.aliyuncs.com/doc/nba.ngql).

Likewise, you can put hundreds or thousands DML (Data Manipulation Language) statements in a *data.ngql* file to insert data. If you have millions of records to insert, it is recommended to use the [csv importer](https://github.com/vesoft-inc/nebula-importer) (or [sst ingest tool](../../3.build-develop-and-administration/3.deploy-and-administrations/server-administration/storage-service-administration/data-import/download-and-ingest-sst-file.md)).
