# Quick Start

This guide helps you walk through the process of using **Nebula Graph**. We will show you how to [create and use a graph space](#creating-a-graph-space), [define the schema for your data](#defining-the-schema-for-your-data), [insert data](#inserting-data), [fetch data](#fetching-data), [update data](#updating-data) and [delete data](#deleting-data). At the end we will show you how to [insert multiple data](#batch-inserting) with a `.text` file.

## Overview

We will show you how to use the **Nebula Graph** database based on the relations between different vertices in the following figure:

![image](https://user-images.githubusercontent.com/40747875/69215979-fd92ff00-0ba5-11ea-9bd4-31841b5a2a5f.png)

In the above figure, there are two tags(_player_, _team_) and two edge types (_serve_ and _follow_).

### Creating and Using a Graph Space

A graph space in **Nebula Graph** is similar to a traditional database. First, you need to create a space and use it before can do any other operations.

You can create and use a graph space by the following steps:

1. Enter the following statement to create a graph space:

```ngql
nebula> CREATE SPACE nba(partition_num=1024, replica_factor=1);
```

**Note**:

* `partition_num` specifies the number of partitions in one replica.
* `replica_factor` specifies the number of replicas in the cluster.

2. Enter the following statement to use the graph space:

```ngql
nebula> USE nba;
```

Now you can check the space you just created by the following statement:

```ngql
nebula> SHOW SPACES;
```

### Defining the Schema for Your Data

In **Nebula Graph** we classify different vertices into one group which is named a tag. The `CREATE TAG` statement defines a tag, with a type name and an attribute list. The `CREATE EDGE` statement defines an edge type.

You can create tags and edge types by the following steps:

1. Enter the following statement to create the _player_ tag:

```ngql
nebula> CREATE TAG player (name string, age int);
```

2. Enter the following statement to create the _team_ tag:

```ngql
nebula> CREATE TAG team (name string);
```

3. Enter the following statement to create the _follow_ edge type:

```ngql
nebula> CREATE EDGE follow(degree int);
```

4. Enter the following statement to create the _serve_ edge type:

```ngql
nebula> CREATE EDGE serve(start_year int, end_year int);
```

Now you can check the tags and edge types you just created.

To show the tags you just created, enter the following statement:

```ngql
nebula> SHOW TAGS;
```

The following information is displayed:

```
============
| Name     |
============
| player   |
------------
| team     |
------------
```

To show the edge types you just created, enter the following statement:

```ngql
nebula> SHOW EDGES;
```

The following information is displayed:

```
==========
| Name   |
==========
| serve |
----------
| follow |
----------
```

To show the attributes of the _player_ tag, enter the following statement:

```ngql
nebula> DESCRIBE TAG player;
```

The following information is displayed:

```
===================
| Field  | Type   |
===================
| name   | string |
-------------------
| age    | int    |
-------------------
```

To show the attributes of the _follow_ edge type, enter the following statement:

```ngql
nebula> DESCRIBE EDGE follow;
```

The following information is displayed:

```
=====================
| Field    | Type   |
=====================
| degree   | int    |
---------------------
```

### Inserting Data

You can insert vertices and edges based on relations in the illustration figure.

#### Inserting Vertices

You can insert some vertices by the following statements:

```ngql
nebula> INSERT VERTEX player(name, age) values 100:("Time", 42);
nebula> INSERT VERTEX player(name, age) values 101:("Tony", 36);
nebula> INSERT VERTEX player(name, age) values 102:("LaMarcus", 33);
nebula> INSERT VERTEX team(name) values 200:("Warriors");
nebula> INSERT VERTEX team(name) values 201:("Nuggets");
nebula> INSERT VERTEX player(name, age) values 121:("Useless", 60);
```

**Note**: The last vertex inserted will be deleted in the [Deleting Data](#deleting-data) section.

#### Inserting Edges

You can insert some edges by the following statements:

```ngql
nebula> INSERT EDGE follow(degree) VALUES 100 -> 101:(95);
nebula> INSERT EDGE follow(degree) VALUES 100 -> 102:(90);
nebula> INSERT EDGE follow(degree) VALUES 102 -> 101:(75);
nebula> INSERT EDGE serve(start_year, end_year) VALUES 100 -> 200:(1997, 2016);
nebula> INSERT EDGE serve(start_year, end_year) VALUES 101 -> 201:(1999, 2018);

```

### Fetching Data

After you insert some data in **Nebula Graph**, you can retrieve any data from your graph database.

To fetch the data of the player whose vertex ID is `100`, enter the following statement:

```ngql
nebula>FETCH PROP ON player 100;
```

The following information is displayed:

```
============================
| player.name | player.age |
============================
| Tim         | 42         |
----------------------------
```

To fetch the data of the _serve_ edge between vertex 100 (100 is the ID of this vertex) and vertex 200 (200 is the ID of this vertex), enter the following statement:

```ngql
nebula>FETCH PROP ON serve 100 -> 200;
```

The following information is displayed:

```
=====================================
| serve.start_year | serve.end_year |
=====================================
| 1997             | 2016           |
-------------------------------------
```

### Updating Data

You can update the vertices and edges you just inserted.

#### Updating Vertices

The following example shows you how to change the _age_ value of vertex `100` from `42` to `41`.

Enter the following statement to update the _age_ value:

```ngql
nebula> UPDATE VERTEX 100 SET player.age = $^.player.age - 1
```

**Note**: `$^` represents the source vertex.

To check whether the _age_ value is updated, enter the following statement:

```ngql
nebula> FETCH PROP ON player 100;
```

The following information is displayed:

```
============================
| player.name | player.age |
============================
| Time        | 41         |
----------------------------
```

#### Updating Edges

The following example shows you how to change the value of the _degree_ attribute in the _follow_ edge between vertex `100` and vertex `101`. Now we change the _degree_ attribute from `95` to `96`.

Enter the following statement to update the _degree_ value:

```ngql
nebula> UPDATE EDGE 100-> 101 OF follow SET degree = follow.degree +1
```

To check whether the _degree_ value is updated, enter the following statement:

```ngql
nebula> FETCH PROP ON follow 100 -> 101;
```

The following information is displayed:

```
=================
| follow.degree |
=================
| 96            |
-----------------
```

### Deleting  Data

If you have some data that you do not need, you can delete it from you graph database.

To delete a vertex whose ID is `121`, enter the following statement:

```ngql
nebula> DELETE VERTEX 121;
```

To check whether the vertex is deleted, enter the following statement;

```ngql
nebula> FETCH PROP ON player 121;
```

The following information is displayed:

```
Execution succeeded (Time spent: 1571/1910 us)
```

**Note**: The above return information indicates the query operation is successful but no data is queried from your graph database because the data is deleted.

### Sample Queries

This section gives more query examples for your reference.

**Example 1**. Find the vertices that `100` (the vertex ID) follows.

Enter the following statement:

```ngql
nebula> GO FROM 100 OVER follow;
```

The following information is returned.

```
===============
| follow._dst |
===============
| 101         |
---------------
| 102         |
---------------
```

**Example 2**. Find the vertex that 100 follows, whose age is greater than 35.
Return his name and age, and set the column names to **Teammate** and **Age** respectively.

Enter the following statement:

```ngql
nebula> GO FROM 100 OVER follow WHERE $$.player.age >= 35 YIELD $$.player.name AS Teammate, $$.player.age AS Age;
```

The following information is returned.

```
==================
| Teammate | Age |
==================
| Tony     | 36  |
------------------
```

**Note**:

* `YIELD` specifies what values or results you might want to return from the query.
* `$^` represents the source vertex.
* `$$` indicates the target vertex.

**Example 3**. Find the team which is served by the player who is followed by `100`.

There are two ways to get the same result. First, we can use a `pipe` to retrieve the team. Then we use a `temporary variable` to retrieve the same team.

Enter the following statement with a `pipe`:

```
GO FROM 100 OVER follow YIELD follow._dst AS id | GO FROM $-.id OVER serve YIELD $$.team.name AS Team;
```

The following information is returned.

```
===========
| Team    |
===========
| Nuggets |
-----------
```

Enter the following statement with a `temporary variable`:

```
$var=GO FROM 100 OVER follow YIELD follow._dst AS id; GO FROM $var.id OVER serve YIELD $$.team.name AS Team;
```

The following information is returned.

```
===========
| Team    |
===========
| Nuggets |
-----------
```

**Note**:

* `|` denotes a pipe. The output of the previous query acts as ab input to the next query.
* `$-` refers to the input stream.
* The second approach adopts a user-defined variable `$var`. The scope of this variable is within the compound statement.

## Batch Inserting

To insert multiple data, you can put all the DDL (data definition language) statements in a `.text` file as follows.

```ngql
CREATE SPACE nba(partition_num=1024, replica_factor=1);
USE nba;
CREATE TAG player(name string, age int);
CREATE TAG team(name string);
CREATE EDGE follow(degree int);
CREATE EDGE serve(start_year int, end_year int);
```

* IF you install **Nebula Graph** by compiling the source code, you can batch write to console by the following command:

```bash
cat  schema.ngql | ./bin/nebula -u user -p password
```

* IF you install **Nebula Graph** by docker-compose, you can batch write to console by the following command:

```bash
cat nba.text | docker run --rm -i --network=host vesoft/nebula-console:nightly --addr=127.0.0.1 --port=32797
```

**Note**: You must change the IP address and the port number to yours.

Likewise, you can put hundreds or thousands DML statements in a `data.text` file to insert data. If you have millions of records to insert, it is recommended to use the csv importer tool (or sst ingest tool).


